programming/python/code/code.org
#+Title: code
#+OPTIONS: ^:nil num:nil author:nil email:nil creator:nil timestamp:nil

#+HTML_HEAD: <style type="text/css" >
#+HTML_HEAD_EXTRA: pre.example {background-color: #ffffff;}
#+HTML_HEAD_EXTRA: pre.src-python {background-color: #ffffff;}
#+HTML_HEAD_EXTRA: </style>

* Chapter 2 - Flow Control

** vampire.py

#+BEGIN_SRC python :tangle vampire.py :padline no
  if name == 'Alice':
      print('Hi, Alice.')
  elif age < 12:
      print('You are not Alice, kiddo.')
  elif age > 2000:
      print('Unlike you, Alice is not an undead, immortal vampire.')
  elif age > 100:
      print('You are not Alice, grannie.')
#+END_SRC

** vampire2.py

#+BEGIN_SRC python :tangle vampire2.py :padline no
  if name == 'Alice':
      print('Hi, Alice.')
  elif age < 12:
      print('You are not Alice, kiddo.')
  elif age > 100:
      print('You are not Alice, grannie.')
  elif age > 2000:
      print('Unlike you, Alice is not an undead, immortal vampire.')
#+END_SRC

** littleKid.py

#+BEGIN_SRC python :tangle littleKid.py :padline no
  if name == 'Alice':
      print('Hi, Alice.')
  elif age < 12:
      print('You are not Alice, kiddo.')
  else:
      print('You are neither Alice nor a little kid.')
#+END_SRC

** swordfish.py

#+BEGIN_SRC python :tangle swordfish.py :padline no
  # swordfish.py WORKS. case sensitive.

  while True:
      print('Who are you?')
      name = input()
      if name != 'Joe':
          continue
      print('Hello, Joe. What is the password? (It is a fish.)')
      password = input()
      if password == 'swordfish':
          break
  print('Access granted.')
#+END_SRC

** fiveTimes.py

#+BEGIN_SRC python :tangle fiveTimes.py :padline no
  # fiveTimes.py FOR LOOP. WORKS
  print('My name is')
  for i in range(5):
      print('Jimmy Five Times (' + str(i) + ')')
#+END_SRC

** printRandom.py

#+BEGIN_SRC python :tangle printRandom.py :padline no
  # printRandom.py. random. WORKS

  import random
  for i in range(5):
      print(random.randint(1, 10))

#+END_SRC

** exitExample.py

#+BEGIN_SRC python :tangle exitExample.py :padline no
  # exitExample.py. EXIT. WORKS

  import sys

  while True:
      print('Type exit to exit.')
      response = input()
      if response == 'exit':
          sys.exit()
      print('You typed ' + response + '.')
#+END_SRC

* Chapter 3 - Functions

** helloFunc.py

#+BEGIN_SRC python :tangle helloFunc.py :padline no
# helloFunc.py. functions. WORKS

def hello():
    print('Howdy!')
    print('Howdy!!!')
    print('Hello there.')

hello()
hello()
hello()
#+END_SRC

