programming/python/code/code.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>code</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">code</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5fe3569">Chapter 2 - Flow Control</a>
<ul>
<li><a href="#org6139367">vampire.py</a></li>
<li><a href="#orgb068cb6">vampire2.py</a></li>
<li><a href="#orgd46c4d7">littleKid.py</a></li>
<li><a href="#orge77e845">swordfish.py</a></li>
<li><a href="#org1c0de86">fiveTimes.py</a></li>
<li><a href="#orgf0f8741">printRandom.py</a></li>
<li><a href="#org7e7e832">exitExample.py</a></li>
</ul>
</li>
<li><a href="#org566dfb0">Chapter 3 - Functions</a>
<ul>
<li><a href="#org68b742d">helloFunc.py</a></li>
<li><a href="#org6d989d8">helloFunc2.py</a></li>
<li><a href="#org17d5f9b">magic8Ball.py</a></li>
<li><a href="#orgcf59ec3">zeroDivide.py</a></li>
<li><a href="#org3e0f612">guessTheNumber.py</a></li>
<li><a href="#org1ca7206">sameName2.py</a></li>
<li><a href="#org8289c16">sameName3.py</a></li>
<li><a href="#orgd19ddaa">sameName4.py</a></li>
<li><a href="#org88b808a">sameName.py</a></li>
</ul>
</li>
<li><a href="#org15b0d75">Chapter 4 - Lists</a>
<ul>
<li><a href="#org2c2f519">allMyCats1.py</a></li>
<li><a href="#org290611f">allMyCats2.py</a></li>
<li><a href="#org3dd4c4c">myPets.py</a></li>
<li><a href="#org453ea1f">magic8Ball2.py</a></li>
<li><a href="#org6e8502b">passingReference.py</a></li>
</ul>
</li>
<li><a href="#org1b10d88">Chapter 5 - Dictionaries and Structuring Data</a>
<ul>
<li><a href="#org8e0c97c">birthdays.py</a></li>
<li><a href="#org30566e8">characterCount.py</a></li>
<li><a href="#org14f2aa2">prettyCharacterCount.py</a></li>
<li><a href="#orgaa966c1">ticTacToe.py</a></li>
<li><a href="#org24ec7b7">inventory.py</a></li>
</ul>
</li>
<li><a href="#orgb5c923b">Chapter 6 - Manipulating Strings</a>
<ul>
<li><a href="#org2e35eff">catnapping.py</a></li>
<li><a href="#org582d3fd">validateInput.py</a></li>
<li><a href="#org08be3d9">picnicTable.py</a></li>
<li><a href="#orgce60e3e">pw.py</a></li>
<li><a href="#org414faeb">bulletPointAdder.py</a></li>
</ul>
</li>
<li><a href="#orge01db14">Chapter 7 - Pattern Matching with Regular Expressions</a>
<ul>
<li><a href="#orgaccf996">isPhoneNumber.py</a></li>
<li><a href="#org64a4ae1">phoneAndEmail.py</a></li>
</ul>
</li>
<li><a href="#orge9505f7">Chapter 8 - Reading and Writing Files</a>
<ul>
<li><a href="#org935ce4c">randomQuizGenerator.py</a></li>
<li><a href="#orgb2fefc0">mcb.pyw</a></li>
</ul>
</li>
<li><a href="#orgcac5aae">Chapter 10 - Debugging</a>
<ul>
<li><a href="#orgf1c3bd2">boxPrint.py</a></li>
<li><a href="#orgb8e1319">buggyAddingProgram.py</a></li>
<li><a href="#org1e4fbd0">coinFlip.py</a></li>
<li><a href="#org3d610a6">errorExample.py</a></li>
<li><a href="#org690d561">factorialLog.py</a></li>
</ul>
</li>
<li><a href="#org9297566">chapter 12 - Working with Excel Spreadsheets</a>
<ul>
<li><a href="#org5fb6897">Opening Excel Documents with OpenPyXL</a></li>
<li><a href="#orgb25e4aa">Getting Sheets from the Workbook</a></li>
<li><a href="#orge400f90">Getting Cells from the Sheets</a></li>
<li><a href="#orgccb9f2c">Converting Between Column Letters and Numbers</a></li>
<li><a href="#orgc5b26af">Getting Rows and Columns from the Sheets</a></li>
<li><a href="#orgee05491">Project: Reading Data from a Spreadsheet</a>
<ul>
<li><a href="#org0111cca">readCensusExcel.py</a></li>
</ul>
</li>
<li><a href="#org9e88c51">Creating and Saving Excel Documents</a></li>
<li><a href="#orgf8f1ee3">Creating and Removing Sheets</a></li>
<li><a href="#orgd1e98a5">Writing Values to Cells</a></li>
<li><a href="#orga3d7cf2">Project: Updating a Spreadsheet</a>
<ul>
<li><a href="#orgc229c70">updateProduce.py</a></li>
</ul>
</li>
<li><a href="#orgc5f5ebe">Adjusting Rows and Columns</a>
<ul>
<li><a href="#orgd836bc5">Setting Row Height and Column Width</a></li>
<li><a href="#org203c307">Merging and Unmerging Cells</a></li>
</ul>
</li>
<li><a href="#org5310ef1">Freeze Panes</a>
<ul>
<li><a href="#orgb36a33c">Table 12-3: Frozen Pane Examples</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5fe3569" class="outline-2">
<h2 id="org5fe3569">Chapter 2 - Flow Control</h2>
<div class="outline-text-2" id="text-org5fe3569">
</div>
<div id="outline-container-org6139367" class="outline-3">
<h3 id="org6139367">vampire.py</h3>
<div class="outline-text-3" id="text-org6139367">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #56b4e9; font-weight: bold;">if</span> name == <span style="color: #848ea9;">'Alice'</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Hi, Alice.'</span>)
<span style="color: #56b4e9; font-weight: bold;">elif</span> age &lt; 12:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'You are not Alice, kiddo.'</span>)
<span style="color: #56b4e9; font-weight: bold;">elif</span> age &gt; 2000:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Unlike you, Alice is not an undead, immortal vampire.'</span>)
<span style="color: #56b4e9; font-weight: bold;">elif</span> age &gt; 100:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'You are not Alice, grannie.'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb068cb6" class="outline-3">
<h3 id="orgb068cb6">vampire2.py</h3>
<div class="outline-text-3" id="text-orgb068cb6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #56b4e9; font-weight: bold;">if</span> name == <span style="color: #848ea9;">'Alice'</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Hi, Alice.'</span>)
<span style="color: #56b4e9; font-weight: bold;">elif</span> age &lt; 12:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'You are not Alice, kiddo.'</span>)
<span style="color: #56b4e9; font-weight: bold;">elif</span> age &gt; 100:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'You are not Alice, grannie.'</span>)
<span style="color: #56b4e9; font-weight: bold;">elif</span> age &gt; 2000:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Unlike you, Alice is not an undead, immortal vampire.'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd46c4d7" class="outline-3">
<h3 id="orgd46c4d7">littleKid.py</h3>
<div class="outline-text-3" id="text-orgd46c4d7">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #56b4e9; font-weight: bold;">if</span> name == <span style="color: #848ea9;">'Alice'</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Hi, Alice.'</span>)
<span style="color: #56b4e9; font-weight: bold;">elif</span> age &lt; 12:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'You are not Alice, kiddo.'</span>)
<span style="color: #56b4e9; font-weight: bold;">else</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'You are neither Alice nor a little kid.'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge77e845" class="outline-3">
<h3 id="orge77e845">swordfish.py</h3>
<div class="outline-text-3" id="text-orge77e845">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">swordfish.py WORKS. case sensitive.</span>

<span style="color: #56b4e9; font-weight: bold;">while</span> <span style="color: #d55e00; font-weight: bold;">True</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Who are you?'</span>)
    <span style="color: #e69f00; font-weight: bold;">name</span> = <span style="color: #0072b2;">input</span>()
    <span style="color: #56b4e9; font-weight: bold;">if</span> name != <span style="color: #848ea9;">'Joe'</span>:
        <span style="color: #56b4e9; font-weight: bold;">continue</span>
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Hello, Joe. What is the password? (It is a fish.)'</span>)
    <span style="color: #e69f00; font-weight: bold;">password</span> = <span style="color: #0072b2;">input</span>()
    <span style="color: #56b4e9; font-weight: bold;">if</span> password == <span style="color: #848ea9;">'swordfish'</span>:
        <span style="color: #56b4e9; font-weight: bold;">break</span>
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Access granted.'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c0de86" class="outline-3">
<h3 id="org1c0de86">fiveTimes.py</h3>
<div class="outline-text-3" id="text-org1c0de86">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">fiveTimes.py FOR LOOP. WORKS</span>
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'My name is'</span>)
<span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(5):
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Jimmy Five Times ('</span> + <span style="color: #0072b2;">str</span>(i) + <span style="color: #848ea9;">')'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0f8741" class="outline-3">
<h3 id="orgf0f8741">printRandom.py</h3>
<div class="outline-text-3" id="text-orgf0f8741">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">printRandom.py. random. WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> random
<span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(5):
    <span style="color: #56b4e9; font-weight: bold;">print</span>(random.randint(1, 10))

</pre>
</div>
</div>
</div>

<div id="outline-container-org7e7e832" class="outline-3">
<h3 id="org7e7e832">exitExample.py</h3>
<div class="outline-text-3" id="text-org7e7e832">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">exitExample.py. EXIT. WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> sys

<span style="color: #56b4e9; font-weight: bold;">while</span> <span style="color: #d55e00; font-weight: bold;">True</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Type exit to exit.'</span>)
    <span style="color: #e69f00; font-weight: bold;">response</span> = <span style="color: #0072b2;">input</span>()
    <span style="color: #56b4e9; font-weight: bold;">if</span> response == <span style="color: #848ea9;">'exit'</span>:
        sys.<span style="color: #d55e00; font-weight: bold;">exit</span>()
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'You typed '</span> + response + <span style="color: #848ea9;">'.'</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org566dfb0" class="outline-2">
<h2 id="org566dfb0">Chapter 3 - Functions</h2>
<div class="outline-text-2" id="text-org566dfb0">
</div>
<div id="outline-container-org68b742d" class="outline-3">
<h3 id="org68b742d">helloFunc.py</h3>
<div class="outline-text-3" id="text-org68b742d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">helloFunc.py. functions. WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">hello</span>():
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Howdy!'</span>)
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Howdy!!!'</span>)
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Hello there.'</span>)

hello()
hello()
hello()
</pre>
</div>
</div>
</div>
