programming/python/code/code.org
** helloFunc2.py

#+BEGIN_SRC python :tangle helloFunc2.py :padline no
# helloFunc2.py. function arguments. WORKS

def hello(name):
    print('Hello ' + name)

hello('Alice')
hello('Bob')
#+END_SRC

** magic8Ball.py

#+BEGIN_SRC python :tangle magic8Ball.py :padline no
  # magic8Ball.py. WORKS

  import random

  def getAnswer(answerNumber):
      if answerNumber == 1:
          return 'It is certain'
      elif answerNumber == 2:
          return 'It is decidedly so'
      elif answerNumber == 3:
          return 'Yes'
      elif answerNumber == 4:
          return 'Reply hazy try again'
      elif answerNumber == 5:
          return 'Ask again later'
      elif answerNumber == 6:
          return 'Concentrate and ask again'
      elif answerNumber == 7:
          return 'My reply is no'
      elif answerNumber == 8:
          return 'Outlook not so good'
      elif answerNumber == 9:
          return 'Very doubtful'

  r = random.randint(1, 9)
  fortune = getAnswer(r)
  print(fortune)
#+END_SRC

** zeroDivide.py

#+BEGIN_SRC python :tangle zeroDivide.py :padline no
  # zeroDivide.py
  # example of bad code
  # Exception Handling

  # def spam(divideBy):
    #  return 42 / divideBy

  def spam(divideBy):
      try:
          return 42 / divideBy
      except ZeroDivisionError:
          print('Error: Invalid argument.')

  print(spam(2))
  print(spam(12))
  print(spam(0))
  print(spam(1))
#+END_SRC

** guessTheNumber.py

#+BEGIN_SRC python :tangle guessTheNumber.py :padline no
  # guessTheNumber.py
  # A Short Program: Guess the Number
  # WORKS

  # This is a guess the number game.

  import random
  secretNumber = random.randint(1, 20)
  print('I am thinking of a number between 1 and 20.')

  # Ask the player to guess 6 times.
  for guessesTaken in range(1, 7):
      print('Take a guess.')
      guess = int(input())

      if guess < secretNumber:
          print('Your guess is too low.')
      elif guess > secretNumber:
          print('Your guess is too high.')
      else:
          break # This condition is the correct guess!

  if guess == secretNumber:
      print('Good job! You guessed my number in ' + str(guessesTaken) + ' guesses!')
  else:
      print('Nope. The number I was thinking of was ' + str(secretNumber))
#+END_SRC

** sameName2.py

#+BEGIN_SRC python :tangle sameName2.py :padline no
  # sameName2.py
  # The global Statement

  def spam():
      global eggs
      eggs = 'spam'
    
  eggs = 'global'
  spam()
  print(eggs)
#+END_SRC

** sameName3.py

#+BEGIN_SRC python :tangle sameName3.py :padline no
  # sameName3.py

  def spam():
      global eggs
      eggs = 'spam' # this is the global

  def bacon():
      eggs = 'bacon' # this is a localw
  def ham():
      print(eggs) # this is the global

  eggs = 42 # this is the global
  spam()
  print(eggs)
#+END_SRC

** sameName4.py

#+BEGIN_SRC python :tangle sameName4.py :padline no
  # sameName4.py
  # example of bad code

  def spam():
      print(eggs) # ERROR!
      eggs = 'spam local'

  eggs = 'global'
  spam()
#+END_SRC

