programming/python/code/code.html

<div id="outline-container-org6d989d8" class="outline-3">
<h3 id="org6d989d8">helloFunc2.py</h3>
<div class="outline-text-3" id="text-org6d989d8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">helloFunc2.py. function arguments. WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">hello</span>(name):
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Hello '</span> + name)

hello(<span style="color: #848ea9;">'Alice'</span>)
hello(<span style="color: #848ea9;">'Bob'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org17d5f9b" class="outline-3">
<h3 id="org17d5f9b">magic8Ball.py</h3>
<div class="outline-text-3" id="text-org17d5f9b">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">magic8Ball.py. WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> random

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">getAnswer</span>(answerNumber):
    <span style="color: #56b4e9; font-weight: bold;">if</span> answerNumber == 1:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #848ea9;">'It is certain'</span>
    <span style="color: #56b4e9; font-weight: bold;">elif</span> answerNumber == 2:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #848ea9;">'It is decidedly so'</span>
    <span style="color: #56b4e9; font-weight: bold;">elif</span> answerNumber == 3:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #848ea9;">'Yes'</span>
    <span style="color: #56b4e9; font-weight: bold;">elif</span> answerNumber == 4:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #848ea9;">'Reply hazy try again'</span>
    <span style="color: #56b4e9; font-weight: bold;">elif</span> answerNumber == 5:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #848ea9;">'Ask again later'</span>
    <span style="color: #56b4e9; font-weight: bold;">elif</span> answerNumber == 6:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #848ea9;">'Concentrate and ask again'</span>
    <span style="color: #56b4e9; font-weight: bold;">elif</span> answerNumber == 7:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #848ea9;">'My reply is no'</span>
    <span style="color: #56b4e9; font-weight: bold;">elif</span> answerNumber == 8:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #848ea9;">'Outlook not so good'</span>
    <span style="color: #56b4e9; font-weight: bold;">elif</span> answerNumber == 9:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #848ea9;">'Very doubtful'</span>

<span style="color: #e69f00; font-weight: bold;">r</span> = random.randint(1, 9)
<span style="color: #e69f00; font-weight: bold;">fortune</span> = getAnswer(r)
<span style="color: #56b4e9; font-weight: bold;">print</span>(fortune)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf59ec3" class="outline-3">
<h3 id="orgcf59ec3">zeroDivide.py</h3>
<div class="outline-text-3" id="text-orgcf59ec3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">zeroDivide.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">example of bad code</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Exception Handling</span>

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">def spam(divideBy):</span>
  <span style="color: #009e73; font-style: italic;">#  </span><span style="color: #009e73; font-style: italic;">return 42 / divideBy</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">spam</span>(divideBy):
    <span style="color: #56b4e9; font-weight: bold;">try</span>:
        <span style="color: #56b4e9; font-weight: bold;">return</span> 42 / divideBy
    <span style="color: #56b4e9; font-weight: bold;">except</span> <span style="color: #0072b2; font-weight: bold;">ZeroDivisionError</span>:
        <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Error: Invalid argument.'</span>)

<span style="color: #56b4e9; font-weight: bold;">print</span>(spam(2))
<span style="color: #56b4e9; font-weight: bold;">print</span>(spam(12))
<span style="color: #56b4e9; font-weight: bold;">print</span>(spam(0))
<span style="color: #56b4e9; font-weight: bold;">print</span>(spam(1))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e0f612" class="outline-3">
<h3 id="org3e0f612">guessTheNumber.py</h3>
<div class="outline-text-3" id="text-org3e0f612">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">guessTheNumber.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">A Short Program: Guess the Number</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">This is a guess the number game.</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> random
<span style="color: #e69f00; font-weight: bold;">secretNumber</span> = random.randint(1, 20)
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'I am thinking of a number between 1 and 20.'</span>)

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Ask the player to guess 6 times.</span>
<span style="color: #56b4e9; font-weight: bold;">for</span> guessesTaken <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(1, 7):
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Take a guess.'</span>)
    <span style="color: #e69f00; font-weight: bold;">guess</span> = <span style="color: #0072b2;">int</span>(<span style="color: #0072b2;">input</span>())

    <span style="color: #56b4e9; font-weight: bold;">if</span> guess &lt; secretNumber:
        <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Your guess is too low.'</span>)
    <span style="color: #56b4e9; font-weight: bold;">elif</span> guess &gt; secretNumber:
        <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Your guess is too high.'</span>)
    <span style="color: #56b4e9; font-weight: bold;">else</span>:
        <span style="color: #56b4e9; font-weight: bold;">break</span> <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">This condition is the correct guess!</span>

<span style="color: #56b4e9; font-weight: bold;">if</span> guess == secretNumber:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Good job! You guessed my number in '</span> + <span style="color: #0072b2;">str</span>(guessesTaken) + <span style="color: #848ea9;">' guesses!'</span>)
<span style="color: #56b4e9; font-weight: bold;">else</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Nope. The number I was thinking of was '</span> + <span style="color: #0072b2;">str</span>(secretNumber))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ca7206" class="outline-3">
<h3 id="org1ca7206">sameName2.py</h3>
<div class="outline-text-3" id="text-org1ca7206">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">sameName2.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">The global Statement</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">spam</span>():
    <span style="color: #56b4e9; font-weight: bold;">global</span> eggs
    <span style="color: #e69f00; font-weight: bold;">eggs</span> = <span style="color: #848ea9;">'spam'</span>

<span style="color: #e69f00; font-weight: bold;">eggs</span> = <span style="color: #848ea9;">'global'</span>
spam()
<span style="color: #56b4e9; font-weight: bold;">print</span>(eggs)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8289c16" class="outline-3">
<h3 id="org8289c16">sameName3.py</h3>
<div class="outline-text-3" id="text-org8289c16">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">sameName3.py</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">spam</span>():
    <span style="color: #56b4e9; font-weight: bold;">global</span> eggs
    <span style="color: #e69f00; font-weight: bold;">eggs</span> = <span style="color: #848ea9;">'spam'</span> <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">this is the global</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">bacon</span>():
    <span style="color: #e69f00; font-weight: bold;">eggs</span> = <span style="color: #848ea9;">'bacon'</span> <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">this is a localw</span>
<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">ham</span>():
    <span style="color: #56b4e9; font-weight: bold;">print</span>(eggs) <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">this is the global</span>

<span style="color: #e69f00; font-weight: bold;">eggs</span> = 42 <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">this is the global</span>
spam()
<span style="color: #56b4e9; font-weight: bold;">print</span>(eggs)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd19ddaa" class="outline-3">
<h3 id="orgd19ddaa">sameName4.py</h3>
<div class="outline-text-3" id="text-orgd19ddaa">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">sameName4.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">example of bad code</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">spam</span>():
    <span style="color: #56b4e9; font-weight: bold;">print</span>(eggs) <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">ERROR!</span>
    <span style="color: #e69f00; font-weight: bold;">eggs</span> = <span style="color: #848ea9;">'spam local'</span>

<span style="color: #e69f00; font-weight: bold;">eggs</span> = <span style="color: #848ea9;">'global'</span>
spam()
</pre>
</div>
</div>
</div>
