programming/python/code/code.org
** sameName.py

#+BEGIN_SRC python :tangle sameName.py :padline no
  # sameName.py
  # Local and Global Variables with the Same Name
  # WORKS

  def spam():
      eggs = 'spam local'
      print(eggs)     # prints 'spam local'
  def bacon():
      eggs = 'bacon local'
      print(eggs) # prints 'bacon local'
      spam()
      print(eggs) # prints 'bacon local'
  eggs = 'global'
  bacon()
  print(eggs) # prints 'global'
#+END_SRC

* Chapter 4 - Lists

** allMyCats1.py

#+BEGIN_SRC python :tangle allMyCats1.py :padline no
  # allMyCats1.py
  # Working with Lists
  # WORKS

  print('Enter the name of cat 1:')
  catName1 = input()
  print('Enter the name of cat 2:')
  catName2 = input()
  print('Enter the name of cat 3:')
  catName3 = input()
  print('Enter the name of cat 4:')
  catName4 = input()
  print('Enter the name of cat 5:')
  catName5 = input()
  print('Enter the name of cat 6:')
  catName6 = input()
  print('The cat names are:')
  print(catName1 + ' ' + catName2 + ' ' + catName3 + ' ' + catName4 + ' ' +
  catName5 + ' ' + catName6)
#+END_SRC

** allMyCats2.py

#+BEGIN_SRC python :tangle allMyCats2.py :padline no
  # allMyCats2.py
  # Working with Lists
  # WORKS

  catNames = []
  while True:
      print('Enter the name of cat ' + str(len(catNames) + 1) +
      ' (Or enter nothing to stop.):')
      name = input()
      if name == '':
          break
      catNames = catNames + [name] # list concatenation
  print('The cat names are:')
  for name in catNames:
      print(' ' + name)
#+END_SRC

** myPets.py

#+BEGIN_SRC python :tangle myPets.py :padline no
  # myPets.py
  # The in and not in Operators
  # WORKS

  myPets = ['Zophie', 'Pooka', 'Fat-tail']
  print('Enter a pet name:')
  name = input()
  if name not in myPets:
      print('I do not have a pet named ' + name)
  else:
      print(name + ' is my pet.')
#+END_SRC

** magic8Ball2.py

#+BEGIN_SRC python :tangle magic8Ball2.py :padline no
  # magic8Ball2.py
  # Example Program: Magic 8 Ball with a List
  # WORKS

  import random

  messages = ['It is certain',
      'It is decidedly so',
      'Yes definitely',
      'Reply hazy try again',
      'Ask again later',
      'Concentrate and ask again',
      'My reply is no',
      'Outlook not so good',
      'Very doubtful']

  print(messages[random.randint(0, len(messages) - 1)])
#+END_SRC

** passingReference.py

#+BEGIN_SRC python :tangle passingReference.py :padline no
  # passingReference.py
  # Passing References
  # WORKS

  def eggs(someParameter):
      someParameter.append('Hello')
      
  spam = [1, 2, 3]
  eggs(spam)
  print(spam)
#+END_SRC

* Chapter 5 - Dictionaries and Structuring Data

