programming/python/code/code.html

<div id="outline-container-org88b808a" class="outline-3">
<h3 id="org88b808a">sameName.py</h3>
<div class="outline-text-3" id="text-org88b808a">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">sameName.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Local and Global Variables with the Same Name</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">spam</span>():
    <span style="color: #e69f00; font-weight: bold;">eggs</span> = <span style="color: #848ea9;">'spam local'</span>
    <span style="color: #56b4e9; font-weight: bold;">print</span>(eggs)     <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">prints 'spam local'</span>
<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">bacon</span>():
    <span style="color: #e69f00; font-weight: bold;">eggs</span> = <span style="color: #848ea9;">'bacon local'</span>
    <span style="color: #56b4e9; font-weight: bold;">print</span>(eggs) <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">prints 'bacon local'</span>
    spam()
    <span style="color: #56b4e9; font-weight: bold;">print</span>(eggs) <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">prints 'bacon local'</span>
<span style="color: #e69f00; font-weight: bold;">eggs</span> = <span style="color: #848ea9;">'global'</span>
bacon()
<span style="color: #56b4e9; font-weight: bold;">print</span>(eggs) <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">prints 'global'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org15b0d75" class="outline-2">
<h2 id="org15b0d75">Chapter 4 - Lists</h2>
<div class="outline-text-2" id="text-org15b0d75">
</div>
<div id="outline-container-org2c2f519" class="outline-3">
<h3 id="org2c2f519">allMyCats1.py</h3>
<div class="outline-text-3" id="text-org2c2f519">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">allMyCats1.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Working with Lists</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter the name of cat 1:'</span>)
<span style="color: #e69f00; font-weight: bold;">catName1</span> = <span style="color: #0072b2;">input</span>()
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter the name of cat 2:'</span>)
<span style="color: #e69f00; font-weight: bold;">catName2</span> = <span style="color: #0072b2;">input</span>()
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter the name of cat 3:'</span>)
<span style="color: #e69f00; font-weight: bold;">catName3</span> = <span style="color: #0072b2;">input</span>()
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter the name of cat 4:'</span>)
<span style="color: #e69f00; font-weight: bold;">catName4</span> = <span style="color: #0072b2;">input</span>()
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter the name of cat 5:'</span>)
<span style="color: #e69f00; font-weight: bold;">catName5</span> = <span style="color: #0072b2;">input</span>()
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter the name of cat 6:'</span>)
<span style="color: #e69f00; font-weight: bold;">catName6</span> = <span style="color: #0072b2;">input</span>()
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'The cat names are:'</span>)
<span style="color: #56b4e9; font-weight: bold;">print</span>(catName1 + <span style="color: #848ea9;">' '</span> + catName2 + <span style="color: #848ea9;">' '</span> + catName3 + <span style="color: #848ea9;">' '</span> + catName4 + <span style="color: #848ea9;">' '</span> +
catName5 + <span style="color: #848ea9;">' '</span> + catName6)
</pre>
</div>
</div>
</div>

<div id="outline-container-org290611f" class="outline-3">
<h3 id="org290611f">allMyCats2.py</h3>
<div class="outline-text-3" id="text-org290611f">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">allMyCats2.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Working with Lists</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #e69f00; font-weight: bold;">catNames</span> = []
<span style="color: #56b4e9; font-weight: bold;">while</span> <span style="color: #d55e00; font-weight: bold;">True</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter the name of cat '</span> + <span style="color: #0072b2;">str</span>(<span style="color: #0072b2;">len</span>(catNames) + 1) +
    <span style="color: #848ea9;">' (Or enter nothing to stop.):'</span>)
    <span style="color: #e69f00; font-weight: bold;">name</span> = <span style="color: #0072b2;">input</span>()
    <span style="color: #56b4e9; font-weight: bold;">if</span> name == <span style="color: #848ea9;">''</span>:
        <span style="color: #56b4e9; font-weight: bold;">break</span>
    <span style="color: #e69f00; font-weight: bold;">catNames</span> = catNames + [name] <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">list concatenation</span>
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'The cat names are:'</span>)
<span style="color: #56b4e9; font-weight: bold;">for</span> name <span style="color: #56b4e9; font-weight: bold;">in</span> catNames:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">' '</span> + name)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3dd4c4c" class="outline-3">
<h3 id="org3dd4c4c">myPets.py</h3>
<div class="outline-text-3" id="text-org3dd4c4c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">myPets.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">The in and not in Operators</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #e69f00; font-weight: bold;">myPets</span> = [<span style="color: #848ea9;">'Zophie'</span>, <span style="color: #848ea9;">'Pooka'</span>, <span style="color: #848ea9;">'Fat-tail'</span>]
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter a pet name:'</span>)
<span style="color: #e69f00; font-weight: bold;">name</span> = <span style="color: #0072b2;">input</span>()
<span style="color: #56b4e9; font-weight: bold;">if</span> name <span style="color: #56b4e9; font-weight: bold;">not</span> <span style="color: #56b4e9; font-weight: bold;">in</span> myPets:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'I do not have a pet named '</span> + name)
<span style="color: #56b4e9; font-weight: bold;">else</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(name + <span style="color: #848ea9;">' is my pet.'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org453ea1f" class="outline-3">
<h3 id="org453ea1f">magic8Ball2.py</h3>
<div class="outline-text-3" id="text-org453ea1f">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">magic8Ball2.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Example Program: Magic 8 Ball with a List</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> random

<span style="color: #e69f00; font-weight: bold;">messages</span> = [<span style="color: #848ea9;">'It is certain'</span>,
    <span style="color: #848ea9;">'It is decidedly so'</span>,
    <span style="color: #848ea9;">'Yes definitely'</span>,
    <span style="color: #848ea9;">'Reply hazy try again'</span>,
    <span style="color: #848ea9;">'Ask again later'</span>,
    <span style="color: #848ea9;">'Concentrate and ask again'</span>,
    <span style="color: #848ea9;">'My reply is no'</span>,
    <span style="color: #848ea9;">'Outlook not so good'</span>,
    <span style="color: #848ea9;">'Very doubtful'</span>]

<span style="color: #56b4e9; font-weight: bold;">print</span>(messages[random.randint(0, <span style="color: #0072b2;">len</span>(messages) - 1)])
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e8502b" class="outline-3">
<h3 id="org6e8502b">passingReference.py</h3>
<div class="outline-text-3" id="text-org6e8502b">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">passingReference.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Passing References</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">eggs</span>(someParameter):
    someParameter.append(<span style="color: #848ea9;">'Hello'</span>)

<span style="color: #e69f00; font-weight: bold;">spam</span> = [1, 2, 3]
eggs(spam)
<span style="color: #56b4e9; font-weight: bold;">print</span>(spam)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1b10d88" class="outline-2">
<h2 id="org1b10d88">Chapter 5 - Dictionaries and Structuring Data</h2>
<div class="outline-text-2" id="text-org1b10d88">
</div>
