programming/python/code/code.org
** birthdays.py

#+BEGIN_SRC python :tangle birthdays.py :padline no
  # birthdays.py
  # Dictionaries vs. Lists
  # WORKS

  birthdays = {'Alice': 'Apr 1', 'Bob': 'Dec 12', 'Carol': 'Mar 4'}

  while True:
      print('Enter a name: (blank to quit)')
      name = input()
      if name == '':
          break
      
      if name in birthdays:
          print(birthdays[name] + ' is the birthday of ' + name)
      else:
          print('I do not have birthday information for ' + name)
          print('What is their birthday?')
          bday = input()
          birthdays[name] = bday
          print('Birthday database updated.')
#+END_SRC

** characterCount.py

#+BEGIN_SRC python :tangle characterCount.py :padline no
  # characterCount.py
  # The setdefault() Method
  # WORKS

  message = 'It was a bright cold day in April, and the clocks were striking thirteen.'
  count = {}

  for character in message:
      count.setdefault(character, 0)
      count[character] = count[character] + 1
  print(count)
#+END_SRC

** prettyCharacterCount.py

#+BEGIN_SRC python :tangle prettyCharacterCount.py :padline no
  # prettyCharacterCount.py
  # Pretty Printing
  # WORKS

  import pprint
  message = 'It was a bright cold day in April, and the clocks were striking thirteen.'
  count = {}

  for character in message:
      count.setdefault(character, 0)
      count[character] = count[character] + 1

  pprint.pprint(count)
#+END_SRC

** ticTacToe.py

#+BEGIN_SRC python :tangle ticTacToe.py :padline no
  # ticTacToe.py
  # A Tic-Tac-Toe Board
  # WORKS but not functional
  # http://nostarch.com/automatestuff/ for full version

  theBoard = {'top-L': ' ', 'top-M': ' ', 'top-R': ' ',
  'mid-L': ' ', 'mid-M': ' ', 'mid-R': ' ',
  'low-L': ' ', 'low-M': ' ', 'low-R': ' '}

  def printBoard(board):
      print(board['top-L'] + '|' + board['top-M'] + '|' + board['top-R'])
      print('-+-+-')
      print(board['mid-L'] + '|' + board['mid-M'] + '|' + board['mid-R'])
      print('-+-+-')
      print(board['low-L'] + '|' + board['low-M'] + '|' + board['low-R'])
  turn = 'X'
  for i in range(9):
      printBoard(theBoard)
      print('Turn for ' + turn + '. Move on which space?')
      move = input()
      theBoard[move] = turn
      if turn == 'X':
          turn = 'O'
      else:
          turn = 'X'
      
  printBoard(theBoard)
#+END_SRC

** inventory.py

#+BEGIN_SRC python :tangle inventory.py :padline no
  # inventory.py
  # Practice Projects
  # WORKS. incomplete

  stuff = {'rope': 1, 'torch': 6, 'gold coin': 42, 'dagger': 1, 'arrow': 12}
  def displayInventory(inventory):
      print("Inventory:")
      item_total = 0
      for k, v in inventory.items():
          print(str(v) + ' ' + k)
          item_total += v
      print("Total number of items: " + str(item_total))
  displayInventory(stuff)

  #def addToInventory(inventory, addedItems):
      # your code goes here

  #inv = {'gold coin': 42, 'rope': 1}
  #dragonLoot = ['gold coin', 'dagger', 'gold coin', 'gold coin', 'ruby']
  #inv = addToInventory(inv, dragonLoot)
  #displayInventory(inv)
#+END_SRC

* Chapter 6 - Manipulating Strings

