programming/python/code/code.html
<div id="outline-container-org8e0c97c" class="outline-3">
<h3 id="org8e0c97c">birthdays.py</h3>
<div class="outline-text-3" id="text-org8e0c97c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">birthdays.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Dictionaries vs. Lists</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #e69f00; font-weight: bold;">birthdays</span> = {<span style="color: #848ea9;">'Alice'</span>: <span style="color: #848ea9;">'Apr 1'</span>, <span style="color: #848ea9;">'Bob'</span>: <span style="color: #848ea9;">'Dec 12'</span>, <span style="color: #848ea9;">'Carol'</span>: <span style="color: #848ea9;">'Mar 4'</span>}

<span style="color: #56b4e9; font-weight: bold;">while</span> <span style="color: #d55e00; font-weight: bold;">True</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter a name: (blank to quit)'</span>)
    <span style="color: #e69f00; font-weight: bold;">name</span> = <span style="color: #0072b2;">input</span>()
    <span style="color: #56b4e9; font-weight: bold;">if</span> name == <span style="color: #848ea9;">''</span>:
        <span style="color: #56b4e9; font-weight: bold;">break</span>

    <span style="color: #56b4e9; font-weight: bold;">if</span> name <span style="color: #56b4e9; font-weight: bold;">in</span> birthdays:
        <span style="color: #56b4e9; font-weight: bold;">print</span>(birthdays[name] + <span style="color: #848ea9;">' is the birthday of '</span> + name)
    <span style="color: #56b4e9; font-weight: bold;">else</span>:
        <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'I do not have birthday information for '</span> + name)
        <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'What is their birthday?'</span>)
        <span style="color: #e69f00; font-weight: bold;">bday</span> = <span style="color: #0072b2;">input</span>()
        <span style="color: #e69f00; font-weight: bold;">birthdays</span>[name] = bday
        <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Birthday database updated.'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org30566e8" class="outline-3">
<h3 id="org30566e8">characterCount.py</h3>
<div class="outline-text-3" id="text-org30566e8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">characterCount.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">The setdefault() Method</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #e69f00; font-weight: bold;">message</span> = <span style="color: #848ea9;">'It was a bright cold day in April, and the clocks were striking thirteen.'</span>
<span style="color: #e69f00; font-weight: bold;">count</span> = {}

<span style="color: #56b4e9; font-weight: bold;">for</span> character <span style="color: #56b4e9; font-weight: bold;">in</span> message:
    count.setdefault(character, 0)
    <span style="color: #e69f00; font-weight: bold;">count</span>[character] = count[character] + 1
<span style="color: #56b4e9; font-weight: bold;">print</span>(count)
</pre>
</div>
</div>
</div>

<div id="outline-container-org14f2aa2" class="outline-3">
<h3 id="org14f2aa2">prettyCharacterCount.py</h3>
<div class="outline-text-3" id="text-org14f2aa2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">prettyCharacterCount.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Pretty Printing</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> pprint
<span style="color: #e69f00; font-weight: bold;">message</span> = <span style="color: #848ea9;">'It was a bright cold day in April, and the clocks were striking thirteen.'</span>
<span style="color: #e69f00; font-weight: bold;">count</span> = {}

<span style="color: #56b4e9; font-weight: bold;">for</span> character <span style="color: #56b4e9; font-weight: bold;">in</span> message:
    count.setdefault(character, 0)
    <span style="color: #e69f00; font-weight: bold;">count</span>[character] = count[character] + 1

pprint.pprint(count)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa966c1" class="outline-3">
<h3 id="orgaa966c1">ticTacToe.py</h3>
<div class="outline-text-3" id="text-orgaa966c1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">ticTacToe.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">A Tic-Tac-Toe Board</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS but not functional</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">http://nostarch.com/automatestuff/ for full version</span>

<span style="color: #e69f00; font-weight: bold;">theBoard</span> = {<span style="color: #848ea9;">'top-L'</span>: <span style="color: #848ea9;">' '</span>, <span style="color: #848ea9;">'top-M'</span>: <span style="color: #848ea9;">' '</span>, <span style="color: #848ea9;">'top-R'</span>: <span style="color: #848ea9;">' '</span>,
<span style="color: #848ea9;">'mid-L'</span>: <span style="color: #848ea9;">' '</span>, <span style="color: #848ea9;">'mid-M'</span>: <span style="color: #848ea9;">' '</span>, <span style="color: #848ea9;">'mid-R'</span>: <span style="color: #848ea9;">' '</span>,
<span style="color: #848ea9;">'low-L'</span>: <span style="color: #848ea9;">' '</span>, <span style="color: #848ea9;">'low-M'</span>: <span style="color: #848ea9;">' '</span>, <span style="color: #848ea9;">'low-R'</span>: <span style="color: #848ea9;">' '</span>}

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">printBoard</span>(board):
    <span style="color: #56b4e9; font-weight: bold;">print</span>(board[<span style="color: #848ea9;">'top-L'</span>] + <span style="color: #848ea9;">'|'</span> + board[<span style="color: #848ea9;">'top-M'</span>] + <span style="color: #848ea9;">'|'</span> + board[<span style="color: #848ea9;">'top-R'</span>])
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'-+-+-'</span>)
    <span style="color: #56b4e9; font-weight: bold;">print</span>(board[<span style="color: #848ea9;">'mid-L'</span>] + <span style="color: #848ea9;">'|'</span> + board[<span style="color: #848ea9;">'mid-M'</span>] + <span style="color: #848ea9;">'|'</span> + board[<span style="color: #848ea9;">'mid-R'</span>])
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'-+-+-'</span>)
    <span style="color: #56b4e9; font-weight: bold;">print</span>(board[<span style="color: #848ea9;">'low-L'</span>] + <span style="color: #848ea9;">'|'</span> + board[<span style="color: #848ea9;">'low-M'</span>] + <span style="color: #848ea9;">'|'</span> + board[<span style="color: #848ea9;">'low-R'</span>])
<span style="color: #e69f00; font-weight: bold;">turn</span> = <span style="color: #848ea9;">'X'</span>
<span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(9):
    printBoard(theBoard)
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Turn for '</span> + turn + <span style="color: #848ea9;">'. Move on which space?'</span>)
    <span style="color: #e69f00; font-weight: bold;">move</span> = <span style="color: #0072b2;">input</span>()
    <span style="color: #e69f00; font-weight: bold;">theBoard</span>[move] = turn
    <span style="color: #56b4e9; font-weight: bold;">if</span> turn == <span style="color: #848ea9;">'X'</span>:
        <span style="color: #e69f00; font-weight: bold;">turn</span> = <span style="color: #848ea9;">'O'</span>
    <span style="color: #56b4e9; font-weight: bold;">else</span>:
        <span style="color: #e69f00; font-weight: bold;">turn</span> = <span style="color: #848ea9;">'X'</span>

printBoard(theBoard)
</pre>
</div>
</div>
</div>

<div id="outline-container-org24ec7b7" class="outline-3">
<h3 id="org24ec7b7">inventory.py</h3>
<div class="outline-text-3" id="text-org24ec7b7">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">inventory.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Practice Projects</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS. incomplete</span>

<span style="color: #e69f00; font-weight: bold;">stuff</span> = {<span style="color: #848ea9;">'rope'</span>: 1, <span style="color: #848ea9;">'torch'</span>: 6, <span style="color: #848ea9;">'gold coin'</span>: 42, <span style="color: #848ea9;">'dagger'</span>: 1, <span style="color: #848ea9;">'arrow'</span>: 12}
<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">displayInventory</span>(inventory):
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">"Inventory:"</span>)
    <span style="color: #e69f00; font-weight: bold;">item_total</span> = 0
    <span style="color: #56b4e9; font-weight: bold;">for</span> k, v <span style="color: #56b4e9; font-weight: bold;">in</span> inventory.items():
        <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #0072b2;">str</span>(v) + <span style="color: #848ea9;">' '</span> + k)
        <span style="color: #e69f00; font-weight: bold;">item_total</span> += v
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">"Total number of items: "</span> + <span style="color: #0072b2;">str</span>(item_total))
displayInventory(stuff)

<span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">def addToInventory(inventory, addedItems):</span>
    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">your code goes here</span>

<span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">inv = {'gold coin': 42, 'rope': 1}</span>
<span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">dragonLoot = ['gold coin', 'dagger', 'gold coin', 'gold coin', 'ruby']</span>
<span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">inv = addToInventory(inv, dragonLoot)</span>
<span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">displayInventory(inv)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb5c923b" class="outline-2">
<h2 id="orgb5c923b">Chapter 6 - Manipulating Strings</h2>
<div class="outline-text-2" id="text-orgb5c923b">
</div>
