programming/python/code/code.org
** catnapping.py

#+BEGIN_SRC python :tangle catnapping.py :padline no
  # catnapping.py
  # Multiline Strings with Triple Quotes
  # WORKS

  print('''Dear Alice,

  Eve's cat has been arrested for catnapping, cat burglary, and extortion.

  Sincerely,
  Bob''')
#+END_SRC

** validateInput.py

#+BEGIN_SRC python :tangle validateInput.py :padline no
  # validateInput.py
  # The isX String Methods
  # WORKS

  while True:
      print('Enter your age:')
      age = input()
      if age.isdecimal():
          break
      print('Please enter a number for your age.')

  while True:
      print('Select a new password (letters and numbers only):')
      password = input()
      if password.isalnum():
          break
      print('Passwords can only have letters and numbers.')
#+END_SRC

** picnicTable.py

#+BEGIN_SRC python :tangle picnicTable.py :padline no
  # picnicTable.py
  # Justifying Text with rjust(), ljust(), and center()
  # WORKS

  def printPicnic(itemsDict, leftWidth, rightWidth):
      print('PICNIC ITEMS'.center(leftWidth + rightWidth, '-'))
      for k, v in itemsDict.items():
          print(k.ljust(leftWidth, '.') + str(v).rjust(rightWidth))

  picnicItems = {'sandwiches': 4, 'apples': 12, 'cups': 4, 'cookies': 8000}
  printPicnic(picnicItems, 12, 5)
  printPicnic(picnicItems, 20, 6)
#+END_SRC

** pw.py

#+BEGIN_SRC python :tangle pw.py :padline no
  #! python3
  # pw.py - An insecure password locker program.
  # Project: Password Locker
  # install pyperclip module
  # Pyperclip could not find a copy/paste mechanism for your system.
  # yum install xclip
  # WORKS

  PASSWORDS = {'email': 'F7minlBDDuvMJuxESSKHFhTxFtjVB6',
               'blog': 'VmALvQyKAxiVH5G8v01if1MLZF3sdt',
               'luggage': '12345'}

  import sys, pyperclip
  if len(sys.argv) < 2:
      print('Usage: py pw.py [account] - copy account password')
      sys.exit()

  account = sys.argv[1]   # first command line arg is the account name

  if account in PASSWORDS:
      pyperclip.copy(PASSWORDS[account])
      print('Password for ' + account + ' copied to clipboard.')
  else:
      print('There is no account named ' + account)
#+END_SRC

** bulletPointAdder.py

#+BEGIN_SRC python :tangle bulletPointAdder.py :padline no
  #! python3
  # bulletPointAdder.py - Adds Wikipedia bullet points to the start
  # of each line of text on the clipboard.
  # Project: Adding Bullets to Wiki Markup
  # WORKS

  import pyperclip
  text = pyperclip.paste()

  # Separate lines and add stars.
  lines = text.split('\n')
  for i in range(len(lines)):    # loop through all indexes for "lines" list
      lines[i] = '* ' + lines[i] # add star to each string in "lines" list
  text = '\n'.join(lines)
  pyperclip.copy(text)
#+END_SRC

* Chapter 7 - Pattern Matching with Regular Expressions

