programming/python/code/code.html
<div id="outline-container-org2e35eff" class="outline-3">
<h3 id="org2e35eff">catnapping.py</h3>
<div class="outline-text-3" id="text-org2e35eff">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">catnapping.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Multiline Strings with Triple Quotes</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'''Dear Alice,</span>

<span style="color: #848ea9;">Eve's cat has been arrested for catnapping, cat burglary, and extortion.</span>

<span style="color: #848ea9;">Sincerely,</span>
<span style="color: #848ea9;">Bob'''</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org582d3fd" class="outline-3">
<h3 id="org582d3fd">validateInput.py</h3>
<div class="outline-text-3" id="text-org582d3fd">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">validateInput.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">The isX String Methods</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">while</span> <span style="color: #d55e00; font-weight: bold;">True</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter your age:'</span>)
    <span style="color: #e69f00; font-weight: bold;">age</span> = <span style="color: #0072b2;">input</span>()
    <span style="color: #56b4e9; font-weight: bold;">if</span> age.isdecimal():
        <span style="color: #56b4e9; font-weight: bold;">break</span>
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Please enter a number for your age.'</span>)

<span style="color: #56b4e9; font-weight: bold;">while</span> <span style="color: #d55e00; font-weight: bold;">True</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Select a new password (letters and numbers only):'</span>)
    <span style="color: #e69f00; font-weight: bold;">password</span> = <span style="color: #0072b2;">input</span>()
    <span style="color: #56b4e9; font-weight: bold;">if</span> password.isalnum():
        <span style="color: #56b4e9; font-weight: bold;">break</span>
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Passwords can only have letters and numbers.'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org08be3d9" class="outline-3">
<h3 id="org08be3d9">picnicTable.py</h3>
<div class="outline-text-3" id="text-org08be3d9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">picnicTable.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Justifying Text with rjust(), ljust(), and center()</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">printPicnic</span>(itemsDict, leftWidth, rightWidth):
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'PICNIC ITEMS'</span>.center(leftWidth + rightWidth, <span style="color: #848ea9;">'-'</span>))
    <span style="color: #56b4e9; font-weight: bold;">for</span> k, v <span style="color: #56b4e9; font-weight: bold;">in</span> itemsDict.items():
        <span style="color: #56b4e9; font-weight: bold;">print</span>(k.ljust(leftWidth, <span style="color: #848ea9;">'.'</span>) + <span style="color: #0072b2;">str</span>(v).rjust(rightWidth))

<span style="color: #e69f00; font-weight: bold;">picnicItems</span> = {<span style="color: #848ea9;">'sandwiches'</span>: 4, <span style="color: #848ea9;">'apples'</span>: 12, <span style="color: #848ea9;">'cups'</span>: 4, <span style="color: #848ea9;">'cookies'</span>: 8000}
printPicnic(picnicItems, 12, 5)
printPicnic(picnicItems, 20, 6)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce60e3e" class="outline-3">
<h3 id="orgce60e3e">pw.py</h3>
<div class="outline-text-3" id="text-orgce60e3e">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">! python3</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">pw.py - An insecure password locker program.</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Project: Password Locker</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">install pyperclip module</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Pyperclip could not find a copy/paste mechanism for your system.</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">yum install xclip</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #e69f00; font-weight: bold;">PASSWORDS</span> = {<span style="color: #848ea9;">'email'</span>: <span style="color: #848ea9;">'F7minlBDDuvMJuxESSKHFhTxFtjVB6'</span>,
             <span style="color: #848ea9;">'blog'</span>: <span style="color: #848ea9;">'VmALvQyKAxiVH5G8v01if1MLZF3sdt'</span>,
             <span style="color: #848ea9;">'luggage'</span>: <span style="color: #848ea9;">'12345'</span>}

<span style="color: #56b4e9; font-weight: bold;">import</span> sys, pyperclip
<span style="color: #56b4e9; font-weight: bold;">if</span> <span style="color: #0072b2;">len</span>(sys.argv) &lt; 2:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Usage: py pw.py [account] - copy account password'</span>)
    sys.<span style="color: #d55e00; font-weight: bold;">exit</span>()

<span style="color: #e69f00; font-weight: bold;">account</span> = sys.argv[1]   <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">first command line arg is the account name</span>

<span style="color: #56b4e9; font-weight: bold;">if</span> account <span style="color: #56b4e9; font-weight: bold;">in</span> PASSWORDS:
    pyperclip.copy(PASSWORDS[account])
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Password for '</span> + account + <span style="color: #848ea9;">' copied to clipboard.'</span>)
<span style="color: #56b4e9; font-weight: bold;">else</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'There is no account named '</span> + account)
</pre>
</div>
</div>
</div>

<div id="outline-container-org414faeb" class="outline-3">
<h3 id="org414faeb">bulletPointAdder.py</h3>
<div class="outline-text-3" id="text-org414faeb">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">! python3</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">bulletPointAdder.py - Adds Wikipedia bullet points to the start</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">of each line of text on the clipboard.</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Project: Adding Bullets to Wiki Markup</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">WORKS</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> pyperclip
<span style="color: #e69f00; font-weight: bold;">text</span> = pyperclip.paste()

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Separate lines and add stars.</span>
<span style="color: #e69f00; font-weight: bold;">lines</span> = text.split(<span style="color: #848ea9;">'\n'</span>)
<span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(<span style="color: #0072b2;">len</span>(lines)):    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">loop through all indexes for "lines" list</span>
    <span style="color: #e69f00; font-weight: bold;">lines</span>[i] = <span style="color: #848ea9;">'* '</span> + lines[i] <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">add star to each string in "lines" list</span>
<span style="color: #e69f00; font-weight: bold;">text</span> = <span style="color: #848ea9;">'\n'</span>.join(lines)
pyperclip.copy(text)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge01db14" class="outline-2">
<h2 id="orge01db14">Chapter 7 - Pattern Matching with Regular Expressions</h2>
<div class="outline-text-2" id="text-orge01db14">
</div>
