programming/python/code/code.org
** isPhoneNumber.py

#+BEGIN_SRC python :tangle isPhoneNumber.py :padline no
  # isPhoneNumber.py
  # works

  def isPhoneNumber(text):
      if len(text) != 12:
          return False
      for i in range(0, 3):
          if not text[i].isdecimal():
              return False
      if text[3] != '-':
          return False
      for i in range(4, 7):
          if not text[i].isdecimal():
              return False
      if text[7] != '-':
          return False
      for i in range(8, 12):
          if not text[i].isdecimal():
              return False
      return True


  print('415-555-4242 is a phone number:')
  print(isPhoneNumber('415-555-4242'))
  print('Moshi moshi is a phone number:')
  print(isPhoneNumber('Moshi moshi'))
#+END_SRC

** phoneAndEmail.py

#+BEGIN_SRC python :tangle phoneAndEmail.py :padline no
  #! python3
  # phoneAndEmail.py - Finds phone numbers and email addresses on the clipboard.
  # works
  # usage: python3.4 ./phoneAndEmail.py
  # copy https://www.nostarch.com/contactus.htm to the clipboard

  import pyperclip, re

  phoneRegex = re.compile(r'''(
      (\d{3}|\(\d{3}\))?                 # area code        
      (\s|-|\.)?                         # separator        
      (\d{3})                            # first 3 digits   
      (\s|-|\.)                          # separator        
      (\d{4})                            # last 4 digits    
      (\s*(ext|x|ext.)\s*(\d{2,5}))?     # extension      
      )''', re.VERBOSE)

  # Create email regex.
  emailRegex = re.compile(r'''(
      [a-zA-Z0-9._%+-]+    # username
      @                    # @ symbol
      [a-zA-Z0-9.-]+       # domain name
      (\.[a-zA-Z]{2,4})    # dot-something
      )''', re.VERBOSE)

  # Find matches in clipboard text.
  text = str(pyperclip.paste())
  matches = []
  for groups in phoneRegex.findall(text):
      phoneNum = '-'.join([groups[1], groups[3], groups[5]])
      if groups[8] != '':
          phoneNum += ' x' + groups[8]
      matches.append(phoneNum)
  for groups in emailRegex.findall(text):
      matches.append(groups[0])

  # Copy results to the clipboard.
  if len(matches) > 0:
      pyperclip.copy('\n'.join(matches))
      print('Copied to clipboard:')
      print('\n'.join(matches))
  else:
      print('No phone numbers or email addresses found.')
#+END_SRC

* Chapter 8 - Reading and Writing Files

