programming/python/code/code.html
<div id="outline-container-orgaccf996" class="outline-3">
<h3 id="orgaccf996">isPhoneNumber.py</h3>
<div class="outline-text-3" id="text-orgaccf996">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">isPhoneNumber.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">works</span>

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">isPhoneNumber</span>(text):
    <span style="color: #56b4e9; font-weight: bold;">if</span> <span style="color: #0072b2;">len</span>(text) != 12:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">False</span>
    <span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(0, 3):
        <span style="color: #56b4e9; font-weight: bold;">if</span> <span style="color: #56b4e9; font-weight: bold;">not</span> text[i].isdecimal():
            <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">False</span>
    <span style="color: #56b4e9; font-weight: bold;">if</span> text[3] != <span style="color: #848ea9;">'-'</span>:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">False</span>
    <span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(4, 7):
        <span style="color: #56b4e9; font-weight: bold;">if</span> <span style="color: #56b4e9; font-weight: bold;">not</span> text[i].isdecimal():
            <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">False</span>
    <span style="color: #56b4e9; font-weight: bold;">if</span> text[7] != <span style="color: #848ea9;">'-'</span>:
        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">False</span>
    <span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(8, 12):
        <span style="color: #56b4e9; font-weight: bold;">if</span> <span style="color: #56b4e9; font-weight: bold;">not</span> text[i].isdecimal():
            <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">False</span>
    <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">True</span>


<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'415-555-4242 is a phone number:'</span>)
<span style="color: #56b4e9; font-weight: bold;">print</span>(isPhoneNumber(<span style="color: #848ea9;">'415-555-4242'</span>))
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Moshi moshi is a phone number:'</span>)
<span style="color: #56b4e9; font-weight: bold;">print</span>(isPhoneNumber(<span style="color: #848ea9;">'Moshi moshi'</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org64a4ae1" class="outline-3">
<h3 id="org64a4ae1">phoneAndEmail.py</h3>
<div class="outline-text-3" id="text-org64a4ae1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">! python3</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">phoneAndEmail.py - Finds phone numbers and email addresses on the clipboard.</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">works</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">usage: python3.4 ./phoneAndEmail.py</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">copy https://www.nostarch.com/contactus.htm to the clipboard</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> pyperclip, re

<span style="color: #e69f00; font-weight: bold;">phoneRegex</span> = re.<span style="color: #0072b2;">compile</span>(r<span style="color: #848ea9;">'''(</span>
<span style="color: #848ea9;">    (\d{3}|\(\d{3}\))?                 # area code        </span>
<span style="color: #848ea9;">    (\s|-|\.)?                         # separator        </span>
<span style="color: #848ea9;">    (\d{3})                            # first 3 digits   </span>
<span style="color: #848ea9;">    (\s|-|\.)                          # separator        </span>
<span style="color: #848ea9;">    (\d{4})                            # last 4 digits    </span>
<span style="color: #848ea9;">    (\s*(ext|x|ext.)\s*(\d{2,5}))?     # extension      </span>
<span style="color: #848ea9;">    )'''</span>, re.VERBOSE)

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Create email regex.</span>
<span style="color: #e69f00; font-weight: bold;">emailRegex</span> = re.<span style="color: #0072b2;">compile</span>(r<span style="color: #848ea9;">'''(</span>
<span style="color: #848ea9;">    [a-zA-Z0-9._%+-]+    # username</span>
<span style="color: #848ea9;">    @                    # @ symbol</span>
<span style="color: #848ea9;">    [a-zA-Z0-9.-]+       # domain name</span>
<span style="color: #848ea9;">    (\.[a-zA-Z]{2,4})    # dot-something</span>
<span style="color: #848ea9;">    )'''</span>, re.VERBOSE)

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Find matches in clipboard text.</span>
<span style="color: #e69f00; font-weight: bold;">text</span> = <span style="color: #0072b2;">str</span>(pyperclip.paste())
<span style="color: #e69f00; font-weight: bold;">matches</span> = []
<span style="color: #56b4e9; font-weight: bold;">for</span> groups <span style="color: #56b4e9; font-weight: bold;">in</span> phoneRegex.findall(text):
    <span style="color: #e69f00; font-weight: bold;">phoneNum</span> = <span style="color: #848ea9;">'-'</span>.join([groups[1], groups[3], groups[5]])
    <span style="color: #56b4e9; font-weight: bold;">if</span> groups[8] != <span style="color: #848ea9;">''</span>:
        <span style="color: #e69f00; font-weight: bold;">phoneNum</span> += <span style="color: #848ea9;">' x'</span> + groups[8]
    matches.append(phoneNum)
<span style="color: #56b4e9; font-weight: bold;">for</span> groups <span style="color: #56b4e9; font-weight: bold;">in</span> emailRegex.findall(text):
    matches.append(groups[0])

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Copy results to the clipboard.</span>
<span style="color: #56b4e9; font-weight: bold;">if</span> <span style="color: #0072b2;">len</span>(matches) &gt; 0:
    pyperclip.copy(<span style="color: #848ea9;">'\n'</span>.join(matches))
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Copied to clipboard:'</span>)
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'\n'</span>.join(matches))
<span style="color: #56b4e9; font-weight: bold;">else</span>:
    <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'No phone numbers or email addresses found.'</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge9505f7" class="outline-2">
<h2 id="orge9505f7">Chapter 8 - Reading and Writing Files</h2>
<div class="outline-text-2" id="text-orge9505f7">
</div>
