programming/python/code/code.html
<div id="outline-container-org935ce4c" class="outline-3">
<h3 id="org935ce4c">randomQuizGenerator.py</h3>
<div class="outline-text-3" id="text-org935ce4c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">! python3</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">randomQuizGenerator.py - Creates quizzes with questions and answers in</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">random order, along with the answer key.</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">works</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> random

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">The quiz data. Keys are states and values are their capitals.</span>
<span style="color: #e69f00; font-weight: bold;">capitals</span> = {<span style="color: #848ea9;">'Alabama'</span>: <span style="color: #848ea9;">'Montgomery'</span>, <span style="color: #848ea9;">'Alaska'</span>: <span style="color: #848ea9;">'Juneau'</span>,
            <span style="color: #848ea9;">'Arizona'</span>: <span style="color: #848ea9;">'Phoenix'</span>,<span style="color: #848ea9;">'Arkansas'</span>: <span style="color: #848ea9;">'Little Rock'</span>,
            <span style="color: #848ea9;">'California'</span>: <span style="color: #848ea9;">'Sacramento'</span>, <span style="color: #848ea9;">'Colorado'</span>: <span style="color: #848ea9;">'Denver'</span>,
            <span style="color: #848ea9;">'Connecticut'</span>: <span style="color: #848ea9;">'Hartford'</span>, <span style="color: #848ea9;">'Delaware'</span>: <span style="color: #848ea9;">'Dover'</span>,
            <span style="color: #848ea9;">'Florida'</span>: <span style="color: #848ea9;">'Tallahassee'</span>,<span style="color: #848ea9;">'Georgia'</span>: <span style="color: #848ea9;">'Atlanta'</span>,
            <span style="color: #848ea9;">'Hawaii'</span>: <span style="color: #848ea9;">'Honolulu'</span>, <span style="color: #848ea9;">'Idaho'</span>: <span style="color: #848ea9;">'Boise'</span>,
            <span style="color: #848ea9;">'Illinois'</span>:<span style="color: #848ea9;">'Springfield'</span>, <span style="color: #848ea9;">'Indiana'</span>: <span style="color: #848ea9;">'Indianapolis'</span>,
            <span style="color: #848ea9;">'Iowa'</span>: <span style="color: #848ea9;">'Des Moines'</span>, <span style="color: #848ea9;">'Kansas'</span>:<span style="color: #848ea9;">'Topeka'</span>,
            <span style="color: #848ea9;">'Kentucky'</span>: <span style="color: #848ea9;">'Frankfort'</span>, <span style="color: #848ea9;">'Louisiana'</span>: <span style="color: #848ea9;">'Baton Rouge'</span>,
            <span style="color: #848ea9;">'Maine'</span>:<span style="color: #848ea9;">'Augusta'</span>, <span style="color: #848ea9;">'Maryland'</span>: <span style="color: #848ea9;">'Annapolis'</span>,
            <span style="color: #848ea9;">'Massachusetts'</span>: <span style="color: #848ea9;">'Boston'</span>, <span style="color: #848ea9;">'Michigan'</span>:<span style="color: #848ea9;">'Lansing'</span>,
            <span style="color: #848ea9;">'Minnesota'</span>: <span style="color: #848ea9;">'Saint Paul'</span>, <span style="color: #848ea9;">'Mississippi'</span>: <span style="color: #848ea9;">'Jackson'</span>,
            <span style="color: #848ea9;">'Missouri'</span>:<span style="color: #848ea9;">'Jefferson City'</span>, <span style="color: #848ea9;">'Montana'</span>: <span style="color: #848ea9;">'Helena'</span>,
            <span style="color: #848ea9;">'Nebraska'</span>: <span style="color: #848ea9;">'Lincoln'</span>, <span style="color: #848ea9;">'Nevada'</span>:<span style="color: #848ea9;">'Carson City'</span>,
            <span style="color: #848ea9;">'New Hampshire'</span>: <span style="color: #848ea9;">'Concord'</span>, <span style="color: #848ea9;">'New Jersey'</span>: <span style="color: #848ea9;">'Trenton'</span>,
            <span style="color: #848ea9;">'New Mexico'</span>: <span style="color: #848ea9;">'Santa Fe'</span>, <span style="color: #848ea9;">'New York'</span>: <span style="color: #848ea9;">'Albany'</span>,
            <span style="color: #848ea9;">'North Carolina'</span>: <span style="color: #848ea9;">'Raleigh'</span>,<span style="color: #848ea9;">'North Dakota'</span>: <span style="color: #848ea9;">'Bismarck'</span>,
            <span style="color: #848ea9;">'Ohio'</span>: <span style="color: #848ea9;">'Columbus'</span>, <span style="color: #848ea9;">'Oklahoma'</span>: <span style="color: #848ea9;">'Oklahoma City'</span>,
            <span style="color: #848ea9;">'Oregon'</span>: <span style="color: #848ea9;">'Salem'</span>, <span style="color: #848ea9;">'Pennsylvania'</span>: <span style="color: #848ea9;">'Harrisburg'</span>,
            <span style="color: #848ea9;">'Rhode Island'</span>: <span style="color: #848ea9;">'Providence'</span>,<span style="color: #848ea9;">'South Carolina'</span>: <span style="color: #848ea9;">'Columbia'</span>,
            <span style="color: #848ea9;">'South Dakota'</span>: <span style="color: #848ea9;">'Pierre'</span>, <span style="color: #848ea9;">'Tennessee'</span>:<span style="color: #848ea9;">'Nashville'</span>,
            <span style="color: #848ea9;">'Texas'</span>: <span style="color: #848ea9;">'Austin'</span>, <span style="color: #848ea9;">'Utah'</span>: <span style="color: #848ea9;">'Salt Lake City'</span>,
            <span style="color: #848ea9;">'Vermont'</span>:<span style="color: #848ea9;">'Montpelier'</span>, <span style="color: #848ea9;">'Virginia'</span>: <span style="color: #848ea9;">'Richmond'</span>,
            <span style="color: #848ea9;">'Washington'</span>: <span style="color: #848ea9;">'Olympia'</span>, <span style="color: #848ea9;">'WestVirginia'</span>: <span style="color: #848ea9;">'Charleston'</span>,
            <span style="color: #848ea9;">'Wisconsin'</span>: <span style="color: #848ea9;">'Madison'</span>, <span style="color: #848ea9;">'Wyoming'</span>: <span style="color: #848ea9;">'Cheyenne'</span>}

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Generate 35 quiz files.</span>

<span style="color: #56b4e9; font-weight: bold;">for</span> quizNum <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(35):
    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Create the quiz and answer key files.</span>
    <span style="color: #e69f00; font-weight: bold;">quizFile</span> = <span style="color: #0072b2;">open</span>(<span style="color: #848ea9;">'capitalsquiz%s.txt'</span> % (quizNum + 1), <span style="color: #848ea9;">'w'</span>)
    <span style="color: #e69f00; font-weight: bold;">answerKeyFile</span> = <span style="color: #0072b2;">open</span>(<span style="color: #848ea9;">'capitalsquiz_answers%s.txt'</span> % (quizNum + 1), <span style="color: #848ea9;">'w'</span>)

    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Write out the header for the quiz.</span>
    quizFile.write(<span style="color: #848ea9;">'Name:\n\nDate:\n\nPeriod:\n\n'</span>)
    quizFile.write((<span style="color: #848ea9;">' '</span> * 20) + <span style="color: #848ea9;">'State Capitals Quiz (Form %s)'</span> % (quizNum + 1))
    quizFile.write(<span style="color: #848ea9;">'\n\n'</span>)

    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Shuffle the order of the states.</span>
    <span style="color: #e69f00; font-weight: bold;">states</span> = <span style="color: #0072b2;">list</span>(capitals.keys())
    random.shuffle(states)

    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Loop through all 50 states, making a question for each.</span>
    <span style="color: #56b4e9; font-weight: bold;">for</span> questionNum <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(50):

        <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Get right and wrong answers.</span>
        <span style="color: #e69f00; font-weight: bold;">correctAnswer</span> = capitals[states[questionNum]]
        <span style="color: #e69f00; font-weight: bold;">wrongAnswers</span> = <span style="color: #0072b2;">list</span>(capitals.values())
        <span style="color: #56b4e9; font-weight: bold;">del</span> wrongAnswers[wrongAnswers.index(correctAnswer)]
        <span style="color: #e69f00; font-weight: bold;">wrongAnswers</span> = random.sample(wrongAnswers, 3)
        <span style="color: #e69f00; font-weight: bold;">answerOptions</span> = wrongAnswers + [correctAnswer]
        random.shuffle(answerOptions)

        <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Write the question and the answer options to the quiz file.</span>
        quizFile.write(<span style="color: #848ea9;">'%s. What is the capital of %s?\n'</span> % (questionNum + 1,
            states[questionNum]))
        <span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(4):
            quizFile.write(<span style="color: #848ea9;">'%s. %s\n'</span> % (<span style="color: #848ea9;">'ABCD'</span>[i], answerOptions[i]))
        quizFile.write(<span style="color: #848ea9;">'\n'</span>)

        <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Write the answer key to a file.</span>
        answerKeyFile.write(<span style="color: #848ea9;">'%s. %s\n'</span> % (questionNum + 1, <span style="color: #848ea9;">'ABCD'</span>[
            answerOptions.index(correctAnswer)]))
quizFile.close()
answerKeyFile.close()
</pre>
</div>
</div>
</div>
