programming/python/code/code.org
** mcb.pyw

#+BEGIN_SRC python :tangle mcb.pyw :padline no
  #! python3
  # mcb.pyw - Saves and loads pieces of text to the clipboard.
  # Usage: py.exe mcb.pyw save <keyword> - Saves clipboard to keyword.
  #        py.exe mcb.pyw <keyword> - Loads keyword to clipboard.
  #        py.exe mcb.pyw list - Loads all keywords to clipboard.

  # works but check what is going on

  import shelve, pyperclip, sys

  mcbShelf = shelve.open('mcb')

  # Save clipboard content.
  if len(sys.argv) == 3 and sys.argv[1].lower() == 'save':
      mcbShelf[sys.argv[2]] = pyperclip.paste()
  elif len(sys.argv) == 2:
      # List keywords and load content.
      if sys.argv[1].lower() == 'list':
          pyperclip.copy(str(list(mcbShelf.keys())))
      elif sys.argv[1] in mcbShelf:
          pyperclip.copy(mcbShelf[sys.argv[1]])
#+END_SRC

* Chapter 10 - Debugging

** boxPrint.py

#+BEGIN_SRC python :tangle boxPrint.py :padline no
  def boxPrint(symbol, width, height):
      if len(symbol) != 1:
          raise Exception('Symbol must be a single character string.')
      if width <= 2:
          raise Exception('Width must be greater than 2.')
      if height <= 2:
          raise Exception('Height must be greater than 2.')
      print(symbol * width)
      for i in range(height - 2):
          print(symbol + (' ' * (width - 2)) + symbol)
      print(symbol * width)

  for sym, w, h in (('*', 4, 4), ('O', 20, 5), ('x', 1, 3), ('ZZ', 3, 3)):
      try:
          boxPrint(sym, w, h)
      except Exception as err:
          print('An exception happened: ' + str(err))
#+END_SRC

** buggyAddingProgram.py

#+BEGIN_SRC python :tangle buggyAddingProgram.py :padline no
  print('Enter the first number to add:')
  first = input()
  print('Enter the second number to add:')
  second = input()
  print('Enter the third number to add:')
  third = input()
  print('The sum is ' + first + second + third)
#+END_SRC

** coinFlip.py

#+BEGIN_SRC python :tangle coinFlip.py :padline no
  import random
  heads = 0
  for i in range(1, 1001):
      if random.randint(0, 1) == 1:
          heads = heads + 1
      if i == 500:
          print('Halfway done!')
  print('Heads came up ' + str(heads) + ' times.')
#+END_SRC

** errorExample.py

#+BEGIN_SRC python :tangle errorExample.py :padline no
  def spam():
      bacon()
      
  def bacon():
      raise Exception('This is the error message.')

  spam()
#+END_SRC

** factorialLog.py

#+BEGIN_SRC python :tangle factorialLog.py :padline no
  import logging
  logging.basicConfig(level=logging.DEBUG, format=' %(asctime)s - %(levelname)s - %(message)s')
  logging.debug('Start of program')

  def factorial(n):
      logging.debug('Start of factorial(%s%%)' % (n))
      total = 1
      # for i in range(n + 1):
      for i in range(1, n + 1):    
          total *= i
          logging.debug('i is ' + str(i) + ', total is ' + str(total))
      logging.debug('End of factorial(%s%%)' % (n))
      return total

  print(factorial(5))
  logging.debug('End of program')
#+END_SRC

* chapter 12 - Working with Excel Spreadsheets

** Opening Excel Documents with OpenPyXL

#+BEGIN_SRC python
  >>> import openpyxl
  >>> wb = openpyxl.load_workbook('example.xlsx')
  >>> type(wb)
  <class 'openpyxl.workbook.workbook.Workbook'>
#+END_SRC

