programming/python/code/code.html

<div id="outline-container-orgb2fefc0" class="outline-3">
<h3 id="orgb2fefc0">mcb.pyw</h3>
<div class="outline-text-3" id="text-orgb2fefc0">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">! python3</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">mcb.pyw - Saves and loads pieces of text to the clipboard.</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Usage: py.exe mcb.pyw save &lt;keyword&gt; - Saves clipboard to keyword.</span>
<span style="color: #009e73; font-style: italic;">#        </span><span style="color: #009e73; font-style: italic;">py.exe mcb.pyw &lt;keyword&gt; - Loads keyword to clipboard.</span>
<span style="color: #009e73; font-style: italic;">#        </span><span style="color: #009e73; font-style: italic;">py.exe mcb.pyw list - Loads all keywords to clipboard.</span>

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">works but check what is going on</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> shelve, pyperclip, sys

<span style="color: #e69f00; font-weight: bold;">mcbShelf</span> = shelve.<span style="color: #0072b2;">open</span>(<span style="color: #848ea9;">'mcb'</span>)

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Save clipboard content.</span>
<span style="color: #56b4e9; font-weight: bold;">if</span> <span style="color: #0072b2;">len</span>(sys.argv) == 3 <span style="color: #56b4e9; font-weight: bold;">and</span> sys.argv[1].lower() == <span style="color: #848ea9;">'save'</span>:
    mcbShelf[sys.argv[2]] = pyperclip.paste()
<span style="color: #56b4e9; font-weight: bold;">elif</span> <span style="color: #0072b2;">len</span>(sys.argv) == 2:
    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">List keywords and load content.</span>
    <span style="color: #56b4e9; font-weight: bold;">if</span> sys.argv[1].lower() == <span style="color: #848ea9;">'list'</span>:
        pyperclip.copy(<span style="color: #0072b2;">str</span>(<span style="color: #0072b2;">list</span>(mcbShelf.keys())))
    <span style="color: #56b4e9; font-weight: bold;">elif</span> sys.argv[1] <span style="color: #56b4e9; font-weight: bold;">in</span> mcbShelf:
        pyperclip.copy(mcbShelf[sys.argv[1]])
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcac5aae" class="outline-2">
<h2 id="orgcac5aae">Chapter 10 - Debugging</h2>
<div class="outline-text-2" id="text-orgcac5aae">
</div>
<div id="outline-container-orgf1c3bd2" class="outline-3">
<h3 id="orgf1c3bd2">boxPrint.py</h3>
<div class="outline-text-3" id="text-orgf1c3bd2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">boxPrint</span>(symbol, width, height):
    <span style="color: #56b4e9; font-weight: bold;">if</span> <span style="color: #0072b2;">len</span>(symbol) != 1:
        <span style="color: #56b4e9; font-weight: bold;">raise</span> <span style="color: #0072b2; font-weight: bold;">Exception</span>(<span style="color: #848ea9;">'Symbol must be a single character string.'</span>)
    <span style="color: #56b4e9; font-weight: bold;">if</span> width &lt;= 2:
        <span style="color: #56b4e9; font-weight: bold;">raise</span> <span style="color: #0072b2; font-weight: bold;">Exception</span>(<span style="color: #848ea9;">'Width must be greater than 2.'</span>)
    <span style="color: #56b4e9; font-weight: bold;">if</span> height &lt;= 2:
        <span style="color: #56b4e9; font-weight: bold;">raise</span> <span style="color: #0072b2; font-weight: bold;">Exception</span>(<span style="color: #848ea9;">'Height must be greater than 2.'</span>)
    <span style="color: #56b4e9; font-weight: bold;">print</span>(symbol * width)
    <span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(height - 2):
        <span style="color: #56b4e9; font-weight: bold;">print</span>(symbol + (<span style="color: #848ea9;">' '</span> * (width - 2)) + symbol)
    <span style="color: #56b4e9; font-weight: bold;">print</span>(symbol * width)

<span style="color: #56b4e9; font-weight: bold;">for</span> sym, w, h <span style="color: #56b4e9; font-weight: bold;">in</span> ((<span style="color: #848ea9;">'*'</span>, 4, 4), (<span style="color: #848ea9;">'O'</span>, 20, 5), (<span style="color: #848ea9;">'x'</span>, 1, 3), (<span style="color: #848ea9;">'ZZ'</span>, 3, 3)):
    <span style="color: #56b4e9; font-weight: bold;">try</span>:
        boxPrint(sym, w, h)
    <span style="color: #56b4e9; font-weight: bold;">except</span> <span style="color: #0072b2; font-weight: bold;">Exception</span> <span style="color: #56b4e9; font-weight: bold;">as</span> err:
        <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'An exception happened: '</span> + <span style="color: #0072b2;">str</span>(err))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8e1319" class="outline-3">
<h3 id="orgb8e1319">buggyAddingProgram.py</h3>
<div class="outline-text-3" id="text-orgb8e1319">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter the first number to add:'</span>)
<span style="color: #e69f00; font-weight: bold;">first</span> = <span style="color: #0072b2;">input</span>()
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter the second number to add:'</span>)
<span style="color: #e69f00; font-weight: bold;">second</span> = <span style="color: #0072b2;">input</span>()
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Enter the third number to add:'</span>)
<span style="color: #e69f00; font-weight: bold;">third</span> = <span style="color: #0072b2;">input</span>()
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'The sum is '</span> + first + second + third)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e4fbd0" class="outline-3">
<h3 id="org1e4fbd0">coinFlip.py</h3>
<div class="outline-text-3" id="text-org1e4fbd0">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #56b4e9; font-weight: bold;">import</span> random
<span style="color: #e69f00; font-weight: bold;">heads</span> = 0
<span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(1, 1001):
    <span style="color: #56b4e9; font-weight: bold;">if</span> random.randint(0, 1) == 1:
        <span style="color: #e69f00; font-weight: bold;">heads</span> = heads + 1
    <span style="color: #56b4e9; font-weight: bold;">if</span> i == 500:
        <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Halfway done!'</span>)
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Heads came up '</span> + <span style="color: #0072b2;">str</span>(heads) + <span style="color: #848ea9;">' times.'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d610a6" class="outline-3">
<h3 id="org3d610a6">errorExample.py</h3>
<div class="outline-text-3" id="text-org3d610a6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">spam</span>():
    bacon()

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">bacon</span>():
    <span style="color: #56b4e9; font-weight: bold;">raise</span> <span style="color: #0072b2; font-weight: bold;">Exception</span>(<span style="color: #848ea9;">'This is the error message.'</span>)

spam()
</pre>
</div>
</div>
</div>

<div id="outline-container-org690d561" class="outline-3">
<h3 id="org690d561">factorialLog.py</h3>
<div class="outline-text-3" id="text-org690d561">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #56b4e9; font-weight: bold;">import</span> logging
logging.basicConfig(level=logging.DEBUG, <span style="color: #0072b2;">format</span>=<span style="color: #848ea9;">' %(asctime)s - %(levelname)s - %(message)s'</span>)
logging.debug(<span style="color: #848ea9;">'Start of program'</span>)

<span style="color: #56b4e9; font-weight: bold;">def</span> <span style="color: #d55e00;">factorial</span>(n):
    logging.debug(<span style="color: #848ea9;">'Start of factorial(%s%%)'</span> % (n))
    <span style="color: #e69f00; font-weight: bold;">total</span> = 1
    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">for i in range(n + 1):</span>
    <span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(1, n + 1):    
        <span style="color: #e69f00; font-weight: bold;">total</span> *= i
        logging.debug(<span style="color: #848ea9;">'i is '</span> + <span style="color: #0072b2;">str</span>(i) + <span style="color: #848ea9;">', total is '</span> + <span style="color: #0072b2;">str</span>(total))
    logging.debug(<span style="color: #848ea9;">'End of factorial(%s%%)'</span> % (n))
    <span style="color: #56b4e9; font-weight: bold;">return</span> total

<span style="color: #56b4e9; font-weight: bold;">print</span>(factorial(5))
logging.debug(<span style="color: #848ea9;">'End of program'</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9297566" class="outline-2">
<h2 id="org9297566">chapter 12 - Working with Excel Spreadsheets</h2>
<div class="outline-text-2" id="text-org9297566">
</div>
<div id="outline-container-org5fb6897" class="outline-3">
<h3 id="org5fb6897">Opening Excel Documents with OpenPyXL</h3>
<div class="outline-text-3" id="text-org5fb6897">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'example.xlsx'</span>)
&gt;&gt;&gt; <span style="color: #0072b2;">type</span>(wb)
&lt;<span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #848ea9;">'openpyxl.workbook.workbook.Workbook'</span>&gt;
</pre>
</div>
</div>
</div>
