programming/python/code/code.org
** Getting Sheets from the Workbook

#+BEGIN_SRC python
  >>> import openpyxl
  >>> wb = openpyxl.load_workbook('example.xlsx')
  >>> type(wb)
  <class 'openpyxl.workbook.workbook.Workbook'>
  >>> import openpyxl
  >>> wb = openpyxl.load_workbook('example.xlsx')
  >>> wb.get_sheet_names()
  ['Sheet1', 'Sheet2', 'Sheet3']
  >>> sheet = wb.get_sheet_by_name('Sheet3')
  >>> sheet
  <Worksheet "Sheet3">
  >>> type(sheet)
  <class 'openpyxl.worksheet.worksheet.Worksheet'>
  >>> sheet.title
  'Sheet3'
  >>> anotherSheet = wb.get_active_sheet()
  >>> anotherSheet
  <Worksheet "Sheet1">
#+END_SRC

** Getting Cells from the Sheets

#+BEGIN_SRC python
  >>> import openpyxl
  >>> wb = openpyxl.load_workbook('example.xlsx')
  >>> sheet = wb.get_sheet_by_name('Sheet1')
  >>> sheet['A1']
  <Cell 'Sheet1'.A1>
  >>> sheet['A1'].value
  datetime.datetime(2015, 4, 5, 13, 34, 2)
  >>> c = sheet['B1']
  >>> c.value
  'Apples'
  >>> 'Row ' + str(c.row) + ', Column ' + c.column + ' is ' + c.value
  'Row 1, Column B is Apples'
  >>> 'Cell ' + c.coordinate + ' is ' + c.value
  'Cell B1 is Apples'
  >>> sheet['C1'].value
  73
  >>> 
#+END_SRC

#+BEGIN_SRC python
  >>> sheet.cell(row=1, column=2)
  <Cell 'Sheet1'.B1>
  >>> sheet.cell(row=1, column=2).value
  'Apples'
  >>> for i in range(1, 8, 2):
  ...     print(i, sheet.cell(row=i, column=2).value)
  ... 
  1 Apples
  3 Pears
  5 Apples
  7 Strawberries
#+END_SRC

#+BEGIN_SRC python
  >>> import openpyxl
  >>> wb = openpyxl.load_workbook('example.xlsx')
  >>> sheet = wb.get_sheet_by_name('Sheet1')
  >>> sheet.max_row
  7
  >>> sheet.max_column
  3
  >>> 
#+END_SRC

** Converting Between Column Letters and Numbers

#+BEGIN_SRC python
  >>> import openpyxl
  >>> from openpyxl.utils import get_column_letter, column_index_from_string
  >>> get_column_letter(1)
  'A'
  >>> get_column_letter(2)
  'B'
  >>> get_column_letter(27)
  'AA'
  >>> get_column_letter(900)
  'AHP'
  >>> wb = openpyxl.load_workbook('example.xlsx')
  >>> sheet = wb.get_sheet_by_name('Sheet1')
  >>> get_column_letter(sheet.max_column)
  'C'
  >>> column_index_from_string('A')
  1
  >>> column_index_from_string('AA')
  27
#+END_SRC

** Getting Rows and Columns from the Sheets

#+BEGIN_SRC python
  >>> import openpyxl
  >>> wb = openpyxl.load_workbook('example.xlsx')
  >>> sheet = wb.get_sheet_by_name('Sheet1')
  >>> tuple(sheet['A1':'C3'])
  ((<Cell 'Sheet1'.A1>, <Cell 'Sheet1'.B1>, <Cell 'Sheet1'.C1>), (<Cell 'Sheet1'.A2>, 
  <Cell 'Sheet1'.B2>, <Cell 'Sheet1'.C2>), (<Cell 'Sheet1'.A3>, <Cell 'Sheet1'.B3>, 
  <Cell 'Sheet1'.C3>))
  >>> for rowOfCellObjects in sheet['A1':'C3']:
  ...     for cellObj in rowOfCellObjects:
  ...         print(cellObj.coordinate, cellObj.value)
  ...     print('--- END OF ROW ---')
  ... 
  A1 2015-04-05 13:34:02
  B1 Apples
  C1 73
  --- END OF ROW ---
  A2 2015-04-05 03:41:23
  B2 Cherries
  C2 85
  --- END OF ROW ---
  A3 2015-04-06 12:46:51
  B3 Pears
  C3 14
  --- END OF ROW ---
#+END_SRC

#+BEGIN_SRC python
  >>> import openpyxl
  >>> wb = openpyxl.load_workbook('example.xlsx')
  >>> sheet = wb.get_active_sheet()
  >>> list(sheet.columns)[1]
  (<Cell 'Sheet1'.B1>, <Cell 'Sheet1'.B2>, <Cell 'Sheet1'.B3>, <Cell 'Sheet1'.B4>, 
  <Cell 'Sheet1'.B5>, <Cell 'Sheet1'.B6>, <Cell 'Sheet1'.B7>)
  >>> for cellObj in list(sheet.columns)[1]:
  ...     print(cellObj.value)
  ... 
  Apples
  Cherries
  Pears
  Oranges
  Apples
  Bananas
  Strawberries
#+END_SRC

** Project: Reading Data from a Spreadsheet

=censuspopdata.xlsx=

