programming/python/code/code.html

<div id="outline-container-orgb25e4aa" class="outline-3">
<h3 id="orgb25e4aa">Getting Sheets from the Workbook</h3>
<div class="outline-text-3" id="text-orgb25e4aa">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'example.xlsx'</span>)
&gt;&gt;&gt; <span style="color: #0072b2;">type</span>(wb)
&lt;<span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #848ea9;">'openpyxl.workbook.workbook.Workbook'</span>&gt;
&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'example.xlsx'</span>)
&gt;&gt;&gt; wb.get_sheet_names()
[<span style="color: #848ea9;">'Sheet1'</span>, <span style="color: #848ea9;">'Sheet2'</span>, <span style="color: #848ea9;">'Sheet3'</span>]
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_sheet_by_name(<span style="color: #848ea9;">'Sheet3'</span>)
&gt;&gt;&gt; sheet
&lt;Worksheet <span style="color: #848ea9;">"Sheet3"</span>&gt;
&gt;&gt;&gt; <span style="color: #0072b2;">type</span>(sheet)
&lt;<span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #848ea9;">'openpyxl.worksheet.worksheet.Worksheet'</span>&gt;
&gt;&gt;&gt; sheet.title
<span style="color: #848ea9;">'Sheet3'</span>
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">anotherSheet</span> = wb.get_active_sheet()
&gt;&gt;&gt; anotherSheet
&lt;Worksheet <span style="color: #848ea9;">"Sheet1"</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orge400f90" class="outline-3">
<h3 id="orge400f90">Getting Cells from the Sheets</h3>
<div class="outline-text-3" id="text-orge400f90">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'example.xlsx'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_sheet_by_name(<span style="color: #848ea9;">'Sheet1'</span>)
&gt;&gt;&gt; sheet[<span style="color: #848ea9;">'A1'</span>]
&lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.A1&gt;
&gt;&gt;&gt; sheet[<span style="color: #848ea9;">'A1'</span>].value
datetime.datetime(2015, 4, 5, 13, 34, 2)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">c</span> = sheet[<span style="color: #848ea9;">'B1'</span>]
&gt;&gt;&gt; c.value
<span style="color: #848ea9;">'Apples'</span>
&gt;&gt;&gt; <span style="color: #848ea9;">'Row '</span> + <span style="color: #0072b2;">str</span>(c.row) + <span style="color: #848ea9;">', Column '</span> + c.column + <span style="color: #848ea9;">' is '</span> + c.value
<span style="color: #848ea9;">'Row 1, Column B is Apples'</span>
&gt;&gt;&gt; <span style="color: #848ea9;">'Cell '</span> + c.coordinate + <span style="color: #848ea9;">' is '</span> + c.value
<span style="color: #848ea9;">'Cell B1 is Apples'</span>
&gt;&gt;&gt; sheet[<span style="color: #848ea9;">'C1'</span>].value
73
&gt;&gt;&gt; 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; sheet.cell(row=1, column=2)
&lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B1&gt;
&gt;&gt;&gt; sheet.cell(row=1, column=2).value
<span style="color: #848ea9;">'Apples'</span>
&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">for</span> i <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(1, 8, 2):
...     <span style="color: #56b4e9; font-weight: bold;">print</span>(i, sheet.cell(row=i, column=2).value)
... 
1 Apples
3 Pears
5 Apples
7 Strawberries
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'example.xlsx'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_sheet_by_name(<span style="color: #848ea9;">'Sheet1'</span>)
&gt;&gt;&gt; sheet.max_row
7
&gt;&gt;&gt; sheet.max_column
3
&gt;&gt;&gt; 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgccb9f2c" class="outline-3">
<h3 id="orgccb9f2c">Converting Between Column Letters and Numbers</h3>
<div class="outline-text-3" id="text-orgccb9f2c">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">from</span> openpyxl.utils <span style="color: #56b4e9; font-weight: bold;">import</span> get_column_letter, column_index_from_string
&gt;&gt;&gt; get_column_letter(1)
<span style="color: #848ea9;">'A'</span>
&gt;&gt;&gt; get_column_letter(2)
<span style="color: #848ea9;">'B'</span>
&gt;&gt;&gt; get_column_letter(27)
<span style="color: #848ea9;">'AA'</span>
&gt;&gt;&gt; get_column_letter(900)
<span style="color: #848ea9;">'AHP'</span>
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'example.xlsx'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_sheet_by_name(<span style="color: #848ea9;">'Sheet1'</span>)
&gt;&gt;&gt; get_column_letter(sheet.max_column)
<span style="color: #848ea9;">'C'</span>
&gt;&gt;&gt; column_index_from_string(<span style="color: #848ea9;">'A'</span>)
1
&gt;&gt;&gt; column_index_from_string(<span style="color: #848ea9;">'AA'</span>)
27
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5b26af" class="outline-3">
<h3 id="orgc5b26af">Getting Rows and Columns from the Sheets</h3>
<div class="outline-text-3" id="text-orgc5b26af">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'example.xlsx'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_sheet_by_name(<span style="color: #848ea9;">'Sheet1'</span>)
&gt;&gt;&gt; <span style="color: #0072b2;">tuple</span>(sheet[<span style="color: #848ea9;">'A1'</span>:<span style="color: #848ea9;">'C3'</span>])
((&lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.A1&gt;, &lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B1&gt;, &lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.C1&gt;), (&lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.A2&gt;, 
&lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B2&gt;, &lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.C2&gt;), (&lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.A3&gt;, &lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B3&gt;, 
&lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.C3&gt;))
&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">for</span> rowOfCellObjects <span style="color: #56b4e9; font-weight: bold;">in</span> sheet[<span style="color: #848ea9;">'A1'</span>:<span style="color: #848ea9;">'C3'</span>]:
...     <span style="color: #56b4e9; font-weight: bold;">for</span> cellObj <span style="color: #56b4e9; font-weight: bold;">in</span> rowOfCellObjects:
...         <span style="color: #56b4e9; font-weight: bold;">print</span>(cellObj.coordinate, cellObj.value)
...     <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'--- END OF ROW ---'</span>)
... 
A1 2015-04-05 13:34:02
B1 Apples
C1 73
--- END OF ROW ---
A2 2015-04-05 03:41:23
B2 Cherries
C2 85
--- END OF ROW ---
A3 2015-04-06 12:46:51
B3 Pears
C3 14
--- END OF ROW ---
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'example.xlsx'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_active_sheet()
&gt;&gt;&gt; <span style="color: #0072b2;">list</span>(sheet.columns)[1]
(&lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B1&gt;, &lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B2&gt;, &lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B3&gt;, &lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B4&gt;, 
&lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B5&gt;, &lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B6&gt;, &lt;Cell <span style="color: #848ea9;">'Sheet1'</span>.B7&gt;)
&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">for</span> cellObj <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">list</span>(sheet.columns)[1]:
...     <span style="color: #56b4e9; font-weight: bold;">print</span>(cellObj.value)
... 
Apples
Cherries
Pears
Oranges
Apples
Bananas
Strawberries
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee05491" class="outline-3">
<h3 id="orgee05491">Project: Reading Data from a Spreadsheet</h3>
<div class="outline-text-3" id="text-orgee05491">
<p>
<code>censuspopdata.xlsx</code>
</p>
</div>
