programming/python/code/code.org
*** readCensusExcel.py

#+BEGIN_SRC python :tangle readCensusExcel.py :padline no
  #! python3
  # readCensusExcel.py - Tabulates population and number of census tracts for
  # each county.

  import openpyxl, pprint
  print('Opening workbook...')
  wb = openpyxl.load_workbook('censuspopdata.xlsx')
  sheet = wb.get_sheet_by_name('Population by Census Tract')
  countyData = {}

  # Fill in countyData with each county's population and tracts.
  print('Reading rows...')
  for row in range(2, sheet.max_row + 1):
      # Each row in the spreadsheet has data for one census tract.
      state = sheet['B' + str(row)].value
      county = sheet['C' + str(row)].value
      pop = sheet['D' + str(row)].value

      # Make sure the key for this state exists.
      countyData.setdefault(state, {})
      # Make sure the key for this county in this state exists.
      countyData[state].setdefault(county, {'tracts': 0, 'pop': 0})

      # Each row represents one census tract, so increment by one.
      countyData[state][county]['tracts'] += 1
      # Increase the county pop by the pop in this census tract.
      countyData[state][county]['pop'] += int(pop)

  # Open a new text file and write the contents of countyData to it.
  print('Writing results...')
  resultFile = open('census2010.py', 'w')
  resultFile.write('allData = ' + pprint.pformat(countyData))
  resultFile.close()
  print('Done.')
#+END_SRC

#+BEGIN_SRC python
  >>> import census2010
  >>> census2010.allData['AK']['Anchorage']
  {'pop': 291826, 'tracts': 55}
  >>> anchoragePop = census2010.allData['AK']['Anchorage']['pop']
  >>> print('The 2010 population of Anchorage was ' + str(anchoragePop))
  The 2010 population of Anchorage was 291826
#+END_SRC

** Creating and Saving Excel Documents

#+BEGIN_SRC python
  >>> import openpyxl
  >>> wb = openpyxl.Workbook()
  >>> wb.get_sheet_names()
  ['Sheet']
  >>> sheet = wb.get_active_sheet()
  >>> sheet.title
  'Sheet'
  >>> sheet.title = 'Spam Bacon Eggs Sheet'
  >>> wb.get_sheet_names()
  ['Spam Bacon Eggs Sheet']
#+END_SRC

#+BEGIN_SRC python
  >>> import openpyxl
  >>> wb = openpyxl.load_workbook('example.xlsx')
  >>> sheet = wb.get_active_sheet()
  >>> sheet.title = 'Spam Spam Spam'
  >>> wb.save('example_copy.xlsx')
#+END_SRC

** Creating and Removing Sheets

#+BEGIN_SRC python
  >>> import openpyxl
  >>> wb = openpyxl.Workbook()
  >>> wb.get_sheet_names()
  ['Sheet']
  >>> wb.create_sheet()
  <Worksheet "Sheet1">
  >>> wb.get_sheet_names()
  ['Sheet', 'Sheet1']
  >>> wb.create_sheet(index=0, title='First Sheet')
  <Worksheet "First Sheet">
  >>> wb.get_sheet_names()
  ['First Sheet', 'Sheet', 'Sheet1']
  >>> wb.create_sheet(index=2, title='Middle Sheet')
  <Worksheet "Middle Sheet">
  >>> wb.get_sheet_names()
  ['First Sheet', 'Sheet', 'Middle Sheet', 'Sheet1']
  >>> wb.remove_sheet(wb.get_sheet_by_name('Middle Sheet'))
  >>> wb.remove_sheet(wb.get_sheet_by_name('Sheet1'))
  >>> wb.get_sheet_names()
  ['First Sheet', 'Sheet']
#+END_SRC

** Writing Values to Cells

#+BEGIN_SRC python
  >>> import openpyxl
  >>> wb = openpyxl.Workbook()
  >>> sheet = wb.get_sheet_by_name('Sheet')
  >>> sheet['A1'] = 'Hello world!'
  >>> sheet['A1'].value
  'Hello world!'
#+END_SRC

** Project: Updating a Spreadsheet

=produceSales.xlsx=

