programming/python/code/code.html

<div id="outline-container-org0111cca" class="outline-4">
<h4 id="org0111cca">readCensusExcel.py</h4>
<div class="outline-text-4" id="text-org0111cca">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">! python3</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">readCensusExcel.py - Tabulates population and number of census tracts for</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">each county.</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl, pprint
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Opening workbook...'</span>)
<span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'censuspopdata.xlsx'</span>)
<span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_sheet_by_name(<span style="color: #848ea9;">'Population by Census Tract'</span>)
<span style="color: #e69f00; font-weight: bold;">countyData</span> = {}

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Fill in countyData with each county's population and tracts.</span>
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Reading rows...'</span>)
<span style="color: #56b4e9; font-weight: bold;">for</span> row <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(2, sheet.max_row + 1):
    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Each row in the spreadsheet has data for one census tract.</span>
    <span style="color: #e69f00; font-weight: bold;">state</span> = sheet[<span style="color: #848ea9;">'B'</span> + <span style="color: #0072b2;">str</span>(row)].value
    <span style="color: #e69f00; font-weight: bold;">county</span> = sheet[<span style="color: #848ea9;">'C'</span> + <span style="color: #0072b2;">str</span>(row)].value
    <span style="color: #e69f00; font-weight: bold;">pop</span> = sheet[<span style="color: #848ea9;">'D'</span> + <span style="color: #0072b2;">str</span>(row)].value

    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Make sure the key for this state exists.</span>
    countyData.setdefault(state, {})
    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Make sure the key for this county in this state exists.</span>
    countyData[state].setdefault(county, {<span style="color: #848ea9;">'tracts'</span>: 0, <span style="color: #848ea9;">'pop'</span>: 0})

    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Each row represents one census tract, so increment by one.</span>
    countyData[state][county][<span style="color: #848ea9;">'tracts'</span>] += 1
    <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Increase the county pop by the pop in this census tract.</span>
    countyData[state][county][<span style="color: #848ea9;">'pop'</span>] += <span style="color: #0072b2;">int</span>(pop)

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Open a new text file and write the contents of countyData to it.</span>
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Writing results...'</span>)
<span style="color: #e69f00; font-weight: bold;">resultFile</span> = <span style="color: #0072b2;">open</span>(<span style="color: #848ea9;">'census2010.py'</span>, <span style="color: #848ea9;">'w'</span>)
resultFile.write(<span style="color: #848ea9;">'allData = '</span> + pprint.pformat(countyData))
resultFile.close()
<span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'Done.'</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> census2010
&gt;&gt;&gt; census2010.allData[<span style="color: #848ea9;">'AK'</span>][<span style="color: #848ea9;">'Anchorage'</span>]
{<span style="color: #848ea9;">'pop'</span>: 291826, <span style="color: #848ea9;">'tracts'</span>: 55}
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">anchoragePop</span> = census2010.allData[<span style="color: #848ea9;">'AK'</span>][<span style="color: #848ea9;">'Anchorage'</span>][<span style="color: #848ea9;">'pop'</span>]
&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">print</span>(<span style="color: #848ea9;">'The 2010 population of Anchorage was '</span> + <span style="color: #0072b2;">str</span>(anchoragePop))
The 2010 population of Anchorage was 291826
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9e88c51" class="outline-3">
<h3 id="org9e88c51">Creating and Saving Excel Documents</h3>
<div class="outline-text-3" id="text-org9e88c51">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.Workbook()
&gt;&gt;&gt; wb.get_sheet_names()
[<span style="color: #848ea9;">'Sheet'</span>]
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_active_sheet()
&gt;&gt;&gt; sheet.title
<span style="color: #848ea9;">'Sheet'</span>
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet.title</span> = <span style="color: #848ea9;">'Spam Bacon Eggs Sheet'</span>
&gt;&gt;&gt; wb.get_sheet_names()
[<span style="color: #848ea9;">'Spam Bacon Eggs Sheet'</span>]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'example.xlsx'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_active_sheet()
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet.title</span> = <span style="color: #848ea9;">'Spam Spam Spam'</span>
&gt;&gt;&gt; wb.save(<span style="color: #848ea9;">'example_copy.xlsx'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8f1ee3" class="outline-3">
<h3 id="orgf8f1ee3">Creating and Removing Sheets</h3>
<div class="outline-text-3" id="text-orgf8f1ee3">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.Workbook()
&gt;&gt;&gt; wb.get_sheet_names()
[<span style="color: #848ea9;">'Sheet'</span>]
&gt;&gt;&gt; wb.create_sheet()
&lt;Worksheet <span style="color: #848ea9;">"Sheet1"</span>&gt;
&gt;&gt;&gt; wb.get_sheet_names()
[<span style="color: #848ea9;">'Sheet'</span>, <span style="color: #848ea9;">'Sheet1'</span>]
&gt;&gt;&gt; wb.create_sheet(index=0, title=<span style="color: #848ea9;">'First Sheet'</span>)
&lt;Worksheet <span style="color: #848ea9;">"First Sheet"</span>&gt;
&gt;&gt;&gt; wb.get_sheet_names()
[<span style="color: #848ea9;">'First Sheet'</span>, <span style="color: #848ea9;">'Sheet'</span>, <span style="color: #848ea9;">'Sheet1'</span>]
&gt;&gt;&gt; wb.create_sheet(index=2, title=<span style="color: #848ea9;">'Middle Sheet'</span>)
&lt;Worksheet <span style="color: #848ea9;">"Middle Sheet"</span>&gt;
&gt;&gt;&gt; wb.get_sheet_names()
[<span style="color: #848ea9;">'First Sheet'</span>, <span style="color: #848ea9;">'Sheet'</span>, <span style="color: #848ea9;">'Middle Sheet'</span>, <span style="color: #848ea9;">'Sheet1'</span>]
&gt;&gt;&gt; wb.remove_sheet(wb.get_sheet_by_name(<span style="color: #848ea9;">'Middle Sheet'</span>))
&gt;&gt;&gt; wb.remove_sheet(wb.get_sheet_by_name(<span style="color: #848ea9;">'Sheet1'</span>))
&gt;&gt;&gt; wb.get_sheet_names()
[<span style="color: #848ea9;">'First Sheet'</span>, <span style="color: #848ea9;">'Sheet'</span>]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd1e98a5" class="outline-3">
<h3 id="orgd1e98a5">Writing Values to Cells</h3>
<div class="outline-text-3" id="text-orgd1e98a5">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.Workbook()
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_sheet_by_name(<span style="color: #848ea9;">'Sheet'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span>[<span style="color: #848ea9;">'A1'</span>] = <span style="color: #848ea9;">'Hello world!'</span>
&gt;&gt;&gt; sheet[<span style="color: #848ea9;">'A1'</span>].value
<span style="color: #848ea9;">'Hello world!'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga3d7cf2" class="outline-3">
<h3 id="orga3d7cf2">Project: Updating a Spreadsheet</h3>
<div class="outline-text-3" id="text-orga3d7cf2">
<p>
<code>produceSales.xlsx</code>
</p>
</div>
