programming/python/code/code.org
*** updateProduce.py

#+BEGIN_SRC python :tangle updateProduce.py :padline no
  #! python3
  # updateProduce.py - Corrects costs in produce sales spreadsheet.
  # works

  import openpyxl

  wb = openpyxl.load_workbook('produceSales.xlsx')
  sheet = wb.get_sheet_by_name('Sheet')

  # The produce types and their updated prices
  PRICE_UPDATES = {'Garlic': 3.07,
                   'Celery': 1.19,
                   'Lemon': 1.27}

  # Loop through the rows and update the prices.
  for rowNum in range(2, sheet.max_row): # skip the first row
      produceName = sheet.cell(row=rowNum, column=1).value
      if produceName in PRICE_UPDATES:
          sheet.cell(row=rowNum, column=2).value = PRICE_UPDATES[produceName]

  wb.save('updatedProduceSales.xlsx')
#+END_SRC

** Adjusting Rows and Columns

*** Setting Row Height and Column Width

#+BEGIN_SRC python works
  >>> import openpyxl
  >>> wb = openpyxl.Workbook()
  >>> sheet = wb.get_active_sheet()
  >>> sheet['A1'] = 'Tall row'
  >>> sheet['B2'] = 'Wide column'
  >>> sheet.row_dimensions[1].height = 70
  >>> sheet.column_dimensions['B'].width = 20
  >>> wb.save('dimensions.xlsx')
#+END_SRC

*** Merging and Unmerging Cells

#+BEGIN_SRC python works
  >>> import openpyxl
  >>> wb = openpyxl.Workbook()
  >>> sheet = wb.get_active_sheet()
  >>> sheet.merge_cells('A1:D3')
  >>> sheet['A1'] = 'Twelve cells merged together.'
  >>> sheet.merge_cells('C5:D5')
  >>> sheet['C5'] = 'Two merged cells.'
  >>> wb.save('merged.xlsx')
#+END_SRC

#+BEGIN_SRC python works
  >>> import openpyxl
  >>> wb = openpyxl.load_workbook('merged.xlsx')
  >>> sheet = wb.get_active_sheet()
  >>> sheet.unmerge_cells('A1:D3')
  >>> sheet.unmerge_cells('C5:D5')
  >>> wb.save('merged.xlsx')
#+END_SRC

** Freeze Panes

*** Table 12-3: Frozen Pane Examples

#+BEGIN_EXAMPLE
  | freeze_panes setting                                   | Rows and columns frozen   |
  |--------------------------------------------------------+---------------------------|
  | sheet.freeze_panes = 'A2'                              | Row 1                     |
  | sheet.freeze_panes = 'B1'                              | Column A                  |
  | sheet.freeze_panes = 'C1'                              | Columns A and B           |
  | sheet.freeze_panes = 'C2'                              | Row 1 and columns A and B |
  | sheet.freeze_panes = 'A1' or sheet.freeze_panes = None | No frozen panes           |
#+END_EXAMPLE

#+BEGIN_SRC python works
  >>> import openpyxl
  >>> wb = openpyxl.load_workbook('produceSales.xlsx')
  >>> sheet = wb.get_active_sheet()
  >>> sheet.freeze_panes = 'A2'
  >>> wb.save('freezeExample.xlsx')
#+END_SRC
