programming/python/code/code.html

<div id="outline-container-orgc229c70" class="outline-4">
<h4 id="orgc229c70">updateProduce.py</h4>
<div class="outline-text-4" id="text-orgc229c70">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #009e73; font-style: italic;">#</span><span style="color: #009e73; font-style: italic;">! python3</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">updateProduce.py - Corrects costs in produce sales spreadsheet.</span>
<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">works</span>

<span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl

<span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'produceSales.xlsx'</span>)
<span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_sheet_by_name(<span style="color: #848ea9;">'Sheet'</span>)

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">The produce types and their updated prices</span>
<span style="color: #e69f00; font-weight: bold;">PRICE_UPDATES</span> = {<span style="color: #848ea9;">'Garlic'</span>: 3.07,
                 <span style="color: #848ea9;">'Celery'</span>: 1.19,
                 <span style="color: #848ea9;">'Lemon'</span>: 1.27}

<span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">Loop through the rows and update the prices.</span>
<span style="color: #56b4e9; font-weight: bold;">for</span> rowNum <span style="color: #56b4e9; font-weight: bold;">in</span> <span style="color: #0072b2;">range</span>(2, sheet.max_row): <span style="color: #009e73; font-style: italic;"># </span><span style="color: #009e73; font-style: italic;">skip the first row</span>
    <span style="color: #e69f00; font-weight: bold;">produceName</span> = sheet.cell(row=rowNum, column=1).value
    <span style="color: #56b4e9; font-weight: bold;">if</span> produceName <span style="color: #56b4e9; font-weight: bold;">in</span> PRICE_UPDATES:
        sheet.cell(row=rowNum, column=2)<span style="color: #e69f00; font-weight: bold;">.value</span> = PRICE_UPDATES[produceName]

wb.save(<span style="color: #848ea9;">'updatedProduceSales.xlsx'</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc5f5ebe" class="outline-3">
<h3 id="orgc5f5ebe">Adjusting Rows and Columns</h3>
<div class="outline-text-3" id="text-orgc5f5ebe">
</div>
<div id="outline-container-orgd836bc5" class="outline-4">
<h4 id="orgd836bc5">Setting Row Height and Column Width</h4>
<div class="outline-text-4" id="text-orgd836bc5">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.Workbook()
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_active_sheet()
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span>[<span style="color: #848ea9;">'A1'</span>] = <span style="color: #848ea9;">'Tall row'</span>
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span>[<span style="color: #848ea9;">'B2'</span>] = <span style="color: #848ea9;">'Wide column'</span>
&gt;&gt;&gt; sheet.row_dimensions[1]<span style="color: #e69f00; font-weight: bold;">.height</span> = 70
&gt;&gt;&gt; sheet.column_dimensions[<span style="color: #848ea9;">'B'</span>]<span style="color: #e69f00; font-weight: bold;">.width</span> = 20
&gt;&gt;&gt; wb.save(<span style="color: #848ea9;">'dimensions.xlsx'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org203c307" class="outline-4">
<h4 id="org203c307">Merging and Unmerging Cells</h4>
<div class="outline-text-4" id="text-org203c307">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.Workbook()
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_active_sheet()
&gt;&gt;&gt; sheet.merge_cells(<span style="color: #848ea9;">'A1:D3'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span>[<span style="color: #848ea9;">'A1'</span>] = <span style="color: #848ea9;">'Twelve cells merged together.'</span>
&gt;&gt;&gt; sheet.merge_cells(<span style="color: #848ea9;">'C5:D5'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span>[<span style="color: #848ea9;">'C5'</span>] = <span style="color: #848ea9;">'Two merged cells.'</span>
&gt;&gt;&gt; wb.save(<span style="color: #848ea9;">'merged.xlsx'</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'merged.xlsx'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_active_sheet()
&gt;&gt;&gt; sheet.unmerge_cells(<span style="color: #848ea9;">'A1:D3'</span>)
&gt;&gt;&gt; sheet.unmerge_cells(<span style="color: #848ea9;">'C5:D5'</span>)
&gt;&gt;&gt; wb.save(<span style="color: #848ea9;">'merged.xlsx'</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5310ef1" class="outline-3">
<h3 id="org5310ef1">Freeze Panes</h3>
<div class="outline-text-3" id="text-org5310ef1">
</div>
<div id="outline-container-orgb36a33c" class="outline-4">
<h4 id="orgb36a33c">Table 12-3: Frozen Pane Examples</h4>
<div class="outline-text-4" id="text-orgb36a33c">
<pre class="example">
| freeze_panes setting                                   | Rows and columns frozen   |
|--------------------------------------------------------+---------------------------|
| sheet.freeze_panes = 'A2'                              | Row 1                     |
| sheet.freeze_panes = 'B1'                              | Column A                  |
| sheet.freeze_panes = 'C1'                              | Columns A and B           |
| sheet.freeze_panes = 'C2'                              | Row 1 and columns A and B |
| sheet.freeze_panes = 'A1' or sheet.freeze_panes = None | No frozen panes           |
</pre>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #56b4e9; font-weight: bold;">import</span> openpyxl
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">wb</span> = openpyxl.load_workbook(<span style="color: #848ea9;">'produceSales.xlsx'</span>)
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet</span> = wb.get_active_sheet()
&gt;&gt;&gt; <span style="color: #e69f00; font-weight: bold;">sheet.freeze_panes</span> = <span style="color: #848ea9;">'A2'</span>
&gt;&gt;&gt; wb.save(<span style="color: #848ea9;">'freezeExample.xlsx'</span>)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
